#-*- coding:utf-8 -*-
from selenium import webdriver
from selenium.webdriver.support.select import Select
from selenium.webdriver.support.wait import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC
from selenium.webdriver.common.by import By
from selenium.common.exceptions import TimeoutException
from selenium.webdriver.common.keys import Keys
from selenium.webdriver.common.action_chains import ActionChains
import time,datetime
from time import sleep
from PIL import Image
import pytesseract # pip install pytesseract
import random
import logging

print('finsh3运行：')
slocaltime = time.asctime( time.localtime(time.time()) )
# logging.basicConfig(format='%(asctime)s %(message)s',level=logging.DEBUG)
# print ("程序开始时间为时间为 :", slocaltime)
def code_tesseract(img_checkcode,checkcode):
    driver.save_screenshot('html.png')
    yzm=driver.find_element_by_id(img_checkcode)
    location=yzm.location#获取验证码x,y轴坐标
    size=yzm.size#获取验证码的长宽
    k = 1.25
    rangle=(int(location['x'])*k,int(location['y'])*k,int(location['x']+size['width'])*k,int(location['y']+size['height'])*k)#截取的位置坐标
    i=Image.open("html.png") #打开截图
    frame4=i.crop(rangle) #使用Image的crop函数，从截图中再次截取我们需要的区域
    frame4.save('code.png')#将截取到的验证码保存为jpg图片
    text = pytesseract.image_to_string(Image.open("code.png")).strip()
    # print(text)
    driver.find_element_by_id(checkcode).clear()
    driver.find_element_by_id(checkcode).send_keys(text)
options = webdriver.FirefoxOptions()
# options.add_argument("--proxy-server=http://1.196.177.213:9999")
options.add_argument('User-Agent="Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/87.0.4280.67 Safari/537.36 Edg/87.0.664.55"')
url='https://isisn.nsfc.gov.cn/egrantindex/funcindex/prjsearch-list'
driver=webdriver.Firefox(executable_path='D:\driver\geckodriver.exe',options=options) # firefox版本：80
driver.maximize_window()
driver.get(url)
# driver.implicitly_wait(10) #隐式等待10秒·
acodes = ['A01.数学', 'A02.力学', 'A03.天文学', 'A04.物理学Ⅰ', 'A05.物理学Ⅱ', 'A06.NSFC-中物院联合基金', 'A08.大科学装置联合基金', 'A09.天文联合基金',
          'B01.合成化学','B02.催化剂与表界面化学','B03.化学理论与机制','B04.化学测量学','B05.材料化学与能源化学','B06.环境化学','B07.化学生物学','B08.化学工程与工业化学',
          'C01.微生物学','C02.植物学','C03.生态学','C04.动物学','C05.生物物理与生物化学','C06.遗传学与生物信息学','C07.细胞生物学','C08.免疫学','C09.神经科学与心理学',
          'C10.生物材料、成像与组织工程学','C11.生理学与整合生物学','C12.发育生物学与生殖生物学','C13.农学基础与作物学','C14.植物保护学','C15.园艺学与植物营养学','C16.林学与草地科学',
          'C17.畜牧学','C18.兽医学','C19.水产学','C20.食品科学','C21.分子生物学与生物技术',
          'D01.地理学','D02.地质学','D03.地球化学','D04.地球物理学和空间物理学','D05.大气科学','D06.海洋科学','D07.环境地球科学',
          'E01.金属材料','E02.无机非金属材料','E03.有机敲分子材料','E04.矿业与治金工程','E05.机械设计与制造','E06.工程热物理与能源利用','E07.电气科学与工程','E08.建筑与土木工程',
          'E09.水利工程','E10.环境工程','E11.海洋工程','E12.交通与运载工程','E13.新概念材料与材料共性科学',
          'F01.电子学与信息系统','F02.计算机科学','F03.自动化','F04.半导体科学与信息器件','F05.光学和光电子学','F06.人工智能','F07.交叉学科中的信息科学',
          'G01.管理科学与工程','G02.工商管理','G03.经济科学','G04.宏观管理与政策',
          'H01.呼吸系统','H02.循环系统','H03.消化系统','H04.生殖系统/围生医学/新生儿','H05.泌尿系统','H06.运动系统','H07.内分泌系统/代谢和营养支持','H08.血液系统','H09.神经系统和精神疾病',
          'H10.医学免疫学', 'H11.皮肤及其附属器', 'H12.眼科学', 'H13.鼻咽喉头颈科学', 'H14.口腔颅领面科学', 'H15.急症医学/创伤/烧伤/整形', 'H16.肿瘤学', 'H17.康复医学', 'H18.影像医学与生物医学工程',
          'H19.医学病原生物与感染', 'H20.检验医学', 'H21.特种医学', 'H22.放射医学', 'H23.法医学', 'H24.地方病学/职业病学', 'H25.老年医学', 'H26预防医学', 'H27.中医学', 'H28.中药学', 'H29.中西医结合', 'H30.药物学', 'H31.药理学',
          'J01.国家基础入才培养基金', 'J02.青少年及软课题', 'J03.重点实验室', 'J04.计划委主任基金',
          'L00.联合基金战略研究', 'L01.农业领域', 'L02.人口与健康领域', 'L03.资源与环境领域', 'L04新材料与先进制造领域', 'L05.电子信息领域', 'L06.生物多样性保护领域', 'L07.矿产资源综合利用与新材料领域', 'L08.水资源与矿产资源领域',
          'L09.矿产资源领域', 'L10.农业', 'L11.新能源新材料领域', 'L12.水产生物资源研究领域', 'L13.食品安全检测技术领域', 'L14.管理科学领域', 'L15.生物与农业领域',
          'M01.委办公室委主任基金', 'R10.国际合作局', 'R20.国际合作局', 'R30.国际合作局', 'R40.国际合作局', 'R50.国际合作局']
allcodes  = {
    'A01':'数学','A0101':'数论','A010101':'解析数论','A010102':'代数数论','A010103':'数论应用','A0102':'代数学','A010201':'群及其表示','A010202':'李群与李代数','A010203':'代数群与量子群','A010204':'同调与','A010205':'环与代数','A010206':'编码与密码','A010207':'代数几何','A0103':'几何学','A010301':'整体微分几何','A010302':'复几何与代数几何','A010303':'几何分析','A0104':'拓扑学','A010401':'代数拓扑与微分拓扑','A010402':'低维流形上的拓扑','A010403':'一般拓扑学','A0105':'函数论','A010501':'多复变函数论','A010502':'复动力系统','A010503':'单复变函数论','A010504':'调和分析与小波分析','A010505':'函数逼近论','A0106':'泛函分析','A010601':'非线性泛函分析','A010602':'算子理论与算子代数','A010603':'空间理论','A0107':'常微分方程与动力系统','A010701':'泛函微分方程','A010702':'定性理论与稳定性理论','A010703':'分支理论与混沌','A010704':'微分动力系统与哈密顿系统','A010705':'拓扑动力系统与遍历论','A0108':'偏微分方程','A010801':'几何','A010802':'非线性椭圆和非线性抛物方程','A010803':'混合型','A010804':'非线性发展方程和无穷维动力系统','A0109':'数学物理','A010901':'规范场论与超弦理论','A010902':'可积系统及其应用','A0110':'概率论与随机分析','A011001':'马氏过程与遍历论','A011002':'随机分析与随机过程','A011003':'随机微分方程','A011004':'极限理论','A0111':'数理统计','A011101':'抽样调查与试验设计','A011102':'时间序列与多元分析','A011103':'数据分析与统计计算','A0112':'运筹学','A011201':'线性与非线性规划','A011202':'组合最优化','A011203':'随机最优化','A011204':'可靠性理论','A0113':'控制论中的数学方法','A011301':'分布参数系统的控制理论','A011302':'随机系统的控制理论','A0114':'应用数学方法','A011401':'信息论','A011402':'经济数学与金融数学','A011403':'生物数学','A011404':'不确定性的数学理论','A011405':'分形论及应用','A0115':'数理逻辑和与计算机相关的数学','A011501':'数理逻辑','A011502':'公理集合论','A011503':'计算复杂性与符号计算','A011504':'机器证明','A0116':'组合数学','A011601':'组合设计','A011602':'图论','A011603':'代数组合与组合矩阵论','A0117':'计算数学与科学工程计算','A011701':'偏微分方程数值计算','A011702':'流体力学中的数值计算','A011703':'一般反问题的计算方法','A011704':'常微分方程数值计算','A011705':'数值代数','A011706':'数值逼近与计算几何','A011707':'谱方法及高精度数值方法','A011708':'有限元和边界元方法','A011709':'多重网格技术及区域分解','A011710':'自适应方法','A011711':'并行算法','A02':'力学','A0201':'力学中的基本问题和方法','A020101':'理性力学与力学中的数学方法','A020102':'物理力学','A020103':'力学中的反问题','A0202':'动力学与控制','A020201':'分析力学','A020202':'动力系统的分岔与混沌','A020203':'运动稳定性及其控制','A020204':'非线性振动及其控制','A020205':'多体系统动力学','A020206':'转子动力学','A020207':'弹道力学与飞行力学','A020208':'载运工具动力学及其控制','A020209':'多场耦合与智能结构动力学','A0203':'固体力学','A020301':'弹性力学与塑性力学','A020302':'损伤与断裂力学','A020303':'疲劳与可靠性','A020304':'本构关系','A020305':'复合材料力学','A020306':'智能材料与结构力学','A020307':'超常环境下材料和结构的力学行为','A020308':'微纳米力学','A020309':'接触','A020310':'表面','A020311':'岩体力学和土力学','A020312':'结构力学与结构优化','A020313':'结构振动','A020314':'流固耦合力学','A020315':'制造工艺力学','A020316':'实验固体力学','A020317':'计算固体力学','A0204':'流体力学','A020401':'湍流与流动稳定性','A020402':'水动力学','A020403':'空气动力学','A020404':'非平衡流与稀薄气体流动','A020405':'多相流与渗流','A020406':'非牛顿流与流变学','A020407':'流动噪声与气动声学','A020408':'流动控制和优化','A020409':'环境流体力学','A020410':'工业流体力学','A020411':'微重力流体力学','A020412':'交通流与颗粒流','A020413':'电磁与多场耦合流体力学','A020414':'实验流体力学','A020415':'计算流体力学','A0205':'生物力学','A020501':'组织与器官系统力学','A020502':'细胞','A020503':'仿生','A0206':'爆炸与冲击动力学','A020601':'爆炸力学','A020602':'冲击动力学','A03':'天文学','A0301':'宇宙学','A030101':'宇宙学模型和参数','A030102':'宇宙结构的形成和演化及观测宇宙学','A030103':'宇宙暗物质和暗能量','A0302':'星系和类星体','A030201':'银河系','A030202':'星系形成','A030203':'星系相互作用和并合','A0303':'恒星与星际物质','A030301':'恒星结构和演化与恒星大气','A030302':'变星和激变变星','A030303':'恒星形成与早期演化','A030304':'晚期演化和致密天体及其相关高能过程','A030305':'太阳系外行星系统','A0304':'太阳和太阳系','A030401':'太阳磁场和太阳发电机','A030402':'太阳日冕物质抛射','A030403':'日震学和太阳内部结构','A030404':'太阳系的起源和演化及太阳系中行星','A030405':'太阳爆发活动对日地空间天气的影响','A0305':'天体中基本物理过程的理论和实验','A030501':'天文中基本物理过程和天体辐射过程的理论和实验','A030502':'实验室天体物理','A0306':'天体测量和天文地球动力学','A030601':'天文参考系及星表','A030602':'相对论天体测量','A030603':'天文地球动力学及天体测量学的应用','A030604':'时间与频率','A0307':'天体力学和人造卫星动力学','A030701':'人造天体','A030702':'','A0308':'天文技术和方法','A030801':'光学','A030802':'射电','A030803':'高能天体物理技术方法和空间天文技术与方法','A030804':'海量数据处理及数值模拟天文技术与方法','A0309':'中','A0310':'天文学同其他学科的交叉','A04':'物理学','A0401':'凝聚态物性','A040101':'固体结构和人工微结构','A040102':'软物质和液体的结构与性质','A040103':'凝聚态物质的力学','A040104':'凝聚态物质的','A040105':'薄膜和纳米结构的形成','A040106':'表面','A040107':'表面','A0402':'凝聚态物性','A040201':'块体材料的电子态','A040202':'强关联电子系统','A040203':'电子输运过程','A040204':'表面','A040205':'介观系统和人工微结构的电子结构','A040206':'超导电性','A040207':'磁有序系统','A040208':'低维','A040209':'介电','A040210':'凝聚态物质的光学和波谱学','A040211':'极端条件下的凝聚态物理','A040212':'量子计算中的凝聚态物理问题','A040213':'软物质','A040214':'生命现象中的凝聚态物理问题','A040215':'凝聚态物理中的新效应及其他问题','A0403':'原子和分子物理','A040301':'原子和分子结构理论','A040302':'原子','A040303':'原子分子碰撞过程及相互作用','A040304':'大分子','A040305':'极端条件下的原子分子物理','A040306':'外场中的原子分子性质及其操控','A040307':'量子信息中的原子分子物理问题','A040308':'与原子','A040309':'冷原子分子物理','A0404':'光学','A040401':'光的传播和成像','A040402':'信息光学中的物理问题','A040403':'光源','A040404':'纤维光学和集成光学中的物理问题','A040405':'光与物质的相互作用','A040406':'超强','A040407':'微纳光学与光子学','A040408':'量子光学和量子信息','A040409':'非线性光学','A040410':'光学材料中物理问题及固体发光','A040411':'激光光谱学及高分辨高灵敏光谱方法','A040412':'','A040413':'光学在生命科学中的应用','A040414':'与光学有关的其他物理问题和交叉学科','A0405':'声学','A040501':'线性与非线性声学','A040502':'水声和海洋声学及空气动力声学','A040503':'超声学','A040504':'噪声','A040505':'生理','A040506':'语言声学','A040507':'声学换能器','A040508':'信息科学中的声学问题','A040509':'建筑声学与电声学','A040510':'与声学有关的其他物理问题和交叉学科','A05':'物理学','A0501':'基础物理学','A050101':'物理学中的数学问题与计算方法','A050102':'经典物理及其唯象学研究','A050103':'量子物理及其应用','A050104':'量子信息学','A050105':'统计物理学与复杂系统','A050106':'相对论','A0502':'粒子物理学和场论','A050201':'场和粒子的一般理论及方法','A050202':'量子色动力学','A050203':'电','A050204':'非标准模型及其唯象学','A050205':'弦论','A050206':'非加速器粒子物理','A050207':'粒子天体物理和宇宙学','A0503':'核物理','A050301':'原子核结构与特性研究','A050302':'原子核高激发态','A050303':'核裂变','A050304':'重离子核物理','A050305':'放射性核束物理','A050306':'中高能核物理','A050307':'核天体物理','A0504':'核技术及其应用','A050401':'离子束与物质相互作用和辐照损伤','A050402':'离子束核分析技术','A050403':'核效应分析技术','A050404':'中子技术及其应用','A050405':'加速器质谱技术','A050406':'离子注入及离子束材料改性','A050407':'核技术在环境科学','A050408':'核技术在工','A050409':'新概念','A0505':'粒子物理与核物理实验方法与技术','A050501':'束流物理与加速器技术','A050502':'荷电粒子源','A050503':'束流传输和测量技术','A050504':'反应堆物理与技术','A050505':'散裂中子源相关技术','A050506':'探测技术和谱仪','A050507':'辐射剂量学和辐射防护','A050508':'实验数据获取与处理','A050509':'新原理','A0506':'等离子体物理','A050601':'等离子体中的基本过程与特性','A050602':'等离子体产生','A050603':'等离子体中的波与不稳定性','A050604':'等离子体中的非线性现象','A050605':'等离子体与物质相互作用','A050606':'等离子体诊断','A050607':'强粒子束与辐射源','A050608':'磁约束等离子体','A050609':'惯性约束等离子体','A050610':'低温等离子体及其应用','A050611':'空间和天体等离子体及特殊等离子体','A0507':'同步辐射技术及其应用','A050701':'同步辐射光源原理和技术','A050702':'自由电子激光原理和技术','A050703':'束线光学技术和实验方法','A06':'','A08':'大科学装置联合基金','A0801':'北京正负电子对撞机','A0802':'上海光源','A0803':'兰州重离子加速器','A0804':'合肥同步辐射','A0805':'稳态强磁场','A0806':'中国散裂中子源装置','A09':'天文联合基金','A0901':'利用天文台设备或数据开展天文观测和理论研究','A0902':'空间天文探测技术研究','A0903':'高能','A0904':'数据','A0905':'基本天文学方法在国家战略需求中的应用研究','A0906':'围绕拟建大型天文设备开展的预研究',
    'B01':'合成化学','B0101':'元素化学','B010101':'主族元素化学','B010102':'过渡金属元素化学','B010103':'稀土与锕系元素化学','B0102':'无机合成','B010201':'无机固相合成','B010202':'无机溶液合成','B010203':'非常规条件下无机合成','B010204':'晶体生长化学','B010205':'纳米与团簇化学','B010206':'功能无机分子的设计与合成','B0103':'有机合成','B010301':'新试剂与新反应','B010302':'活性中间体化学','B010303':'金属催化合成反应','B010304':'有机小分子催化','B010305':'不对称合成','B010306':'天然产物全合成','B010307':'功能有机分子的设计与合成','B0104':'高分子合成','B010401':'聚合反应与方法','B010402':'离子聚合与配位聚合','B010403':'自由基聚合','B010404':'逐步聚合','B010405':'高分子光化学与辐射化学','B010406':'高分子精密合成','B0105':'配位合成化学','B010501':'配位反应','B010502':'溶液配位化学','B010503':'功能配合物化学','B010504':'金属有机化学','B010505':'配位聚合物','B0106':'超分子化学与组装','B010601':'组装基元','B010602':'非共价相互作用与组装方法','B010603':'动态共价键化学','B010604':'组装过程的动态调控','B010605':'超分子复合物与聚合物','B010606':'生命功能体系的组装','B0107':'绿色合成','B010701':'生物催化与生物转化','B010702':'模拟酶与仿生合成','B010703':'光化学合成','B010704':'原子与步骤经济性反应','B010705':'可再生资源化学','B010706':'温和条件下的化学转化','B02':'催化与表界面化学','B0201':'催化化学','B020101':'催化基础与理论','B020102':'催化剂设计与制备','B020103':'多相催化','B020104':'均相催化','B020105':'团簇仿生催化','B020106':'光催化','B020107':'催化表征方法与技术','B0202':'表面化学','B020201':'表面结构与性质','B020202':'表面分子反应过程','B020203':'表面组装过程与功能','B020204':'表面化学研究方法','B0203':'胶体与界面化学','B020301':'表面活性剂与分散体系','B020302':'溶胶与凝胶','B020303':'浸润性与吸附','B020304':'界面组装与聚集体','B020305':'胶体颗粒与纳米晶','B020306':'外场响应性胶体体系','B020307':'胶体与界面理论方法及表征技术','B0204':'电化学','B020401':'基础与理论电化学','B020402':'谱学电化学','B020403':'界面与纳米电化学','B020404':'电催化与电合成','B020405':'光电化学','B020406':'电解质与离子电化学','B020407':'生物电化学','B020408':'腐蚀电化学与电化学加工基础','B03':'化学理论与机制','B0301':'理论与计算化学','B030101':'量子化学','B030102':'化学统计力学','B030103':'化学动力学理论','B030104':'计算模拟方法与应用','B030105':'化学程序与软件','B0302':'化学热力学','B030201':'化学平衡与热力学参数','B030202':'溶液化学','B030203':'量热学','B030204':'复杂流体','B030205':'非平衡态热力学','B030206':'统计热力学','B0303':'化学动态学','B030301':'宏观动力学','B030302':'分子反应动力学','B030303':'超快与激发态动力学','B030304':'燃烧化学动力学','B030305':'非绝热动力学','B0304':'结构化学','B030401':'溶液结构','B030402':'表面结构','B030403':'体相结构','B030404':'纳米及介观结构','B030405':'动态结构','B030406':'结构表征方法与技术','B0305':'光化学与光谱学','B030501':'激光光谱学','B030502':'分子光谱学','B030503':'激发态化学','B030504':'光化学与光物理过程','B0306':'化学反应机制','B030601':'理论无机化学','B030602':'无机反应热力学与动力学','B030603':'有机化学反应机制','B030604':'理论与计算有机化学','B030605':'单分子电子学','B030606':'分子磁学','B0307':'高分子物理与高分子物理化学','B030701':'高分子表征方法','B030702':'大分子理论','B030703':'高分子结晶与相变机制','B030704':'高分子结构','B030705':'高分子流变学','B030706':'大分子链行为与相互作用','B0308':'化学信息学','B030801':'分子信息学','B030802':'化学反应过程信息学','B030803':'化学大数据挖掘','B030804':'化学计量学','B04':'化学测量学','B0401':'分离分析','B040101':'样品处理','B040102':'分离介质','B040103':'色谱分析','B040104':'电泳分析','B040105':'微纳流控','B040106':'组学分析','B0402':'电分析化学','B040201':'电分析化学基础','B040202':'微电极与超微电极','B040203':'谱学电分析化学','B040204':'单分子电分析化学','B040205':'生物电分析化学','B040206':'光','B0403':'谱学方法与理论','B040301':'原子光谱','B040302':'分子光谱','B040303':'质谱分析','B040304':'磁共振波谱','B040305':'能谱分析','B040306':'量热分析','B040307':'谱学信息解析','B0404':'化学与生物传感','B040401':'传感原理及方法','B040402':'探针标记与传感','B040403':'单分子单细胞单颗粒分析','B040404':'核酸与蛋白分析','B040405':'活体分析','B040406':'生物芯片','B040407':'极端条件下分析技术','B0405':'化学成像','B040501':'成像原理与技术','B040502':'表界面成像','B040503':'元素与分子成像','B040504':'细胞成像','B040505':'活体成像','B040506':'多模态多尺度成像','B040507':'动态成像与大数据分析','B0406':'化学分析与应用','B040601':'食品分析','B040602':'有机与天然产物分析','B040603':'生物与药物分析','B040604':'资源与环境分析','B040605':'精准医学分析','B040606':'防化与放射分析','B040607':'公共安全分析与溯源','B0407':'仪器创制','B040701':'基于新概念新原理的仪器与装置','B040702':'超快光谱与成像技术','B040703':'超高时','B040704':'超高能量分辨与谱学技术','B040705':'超高灵敏谱学与成像技术','B040706':'非标记生物成像技术','B040707':'单分子谱学与成像技术','B040708':'智能化与微型化仪器装置','B040709':'大科学装置与应用','B05':'材料化学与能源化学','B0501':'无机与纳米材料化学','B050101':'晶态固体材料化学','B050102':'非晶态材料化学','B050103':'无机膜材料化学','B050104':'低维纳米材料化学','B050105':'团簇材料化学','B050106':'分子基材料化学','B0502':'有机高分子功能材料化学','B050201':'吸附与分离功能分子','B050202':'生物医用高分子','B050203':'药物传输与缓释','B050204':'液晶分子','B050205':'光电磁功能分子','B0503':'有机高分子结构材料化学','B050301':'高分子改性与反应加工成型','B050302':'高分子的降解','B050303':'化学纤维与聚合物弹性体','B050304':'高性能聚合物','B050305':'生物质材料化学','B0504':'复合与杂化材料化学','B050401':'复合界面化学','B050402':'杂化材料化学','B050403':'聚合物基复合材料化学','B050404':'纳米复合材料化学','B050405':'多孔材料化学','B050406':'柔性与可穿戴材料化学','B0505':'智能与仿生材料化学','B050501':'可修复材料化学','B050502':'外场响应的材料化学','B050503':'结构与功能仿生材料化学','B050504':'表界面仿生材料化学','B050505':'生物矿化与过程仿生化学','B0506':'含能材料化学','B050601':'含能分子设计与合成','B050602':'含能材料性能调控与评价','B050603':'超高能材料化学','B050604':'含能材料安全性与稳定性','B0507':'碳基能源化学','B050701':'天然气活化与转化','B050702':'煤转化化学基础','B050703':'石油资源化学','B050704':'二氧化碳化学转化','B0508':'电化学能源化学','B050801':'超级电容器','B050802':'燃料电池','B050803':'化学电源','B050804':'太阳能电池','B050805':'其他新型电池','B050806':'电池回收化学','B0509':'可再生与可持续能源化学','B050901':'氢能源化学','B050902':'人工光合过程','B050903':'化学固氮与转化','B050904':'太阳能化学利用','B050905':'生物质能源化学','B0510':'能量转换材料化学','B051001':'储能相变材料化学','B051002':'光电转换材料化学','B051003':'热电材料化学','B051004':'光热材料化学','B051005':'其他能量转化材料化学','B06':'环境化学','B0601':'环境污染化学','B060101':'环境分析化学','B060102':'大气污染化学','B060103':'水污染化学','B060104':'土壤污染化学','B060105':'污染物迁移转化与区域环境过程','B060106':'纳米环境化学','B0602':'污染控制化学','B060201':'大气污染控制化学','B060202':'水污染控制化学','B060203':'土壤污染控制化学','B060204':'固体废物污染控制化学','B060205':'污染形成机制与全过程控制','B060206':'环境催化化学','B0603':'环境毒理与健康','B060301':'环境暴露与毒理学','B060302':'环境污染生物标志物','B060303':'毒性效应与机制','B060304':'环境污染与食品安全','B060305':'污染生态化学与生态风险','B060306':'环境污染与人体健康','B0604':'理论环境化学','B060401':'环境计算化学','B060402':'环境风险甄别与解析','B060403':'环境污染模拟与预测','B060404':'环境化学大数据分析','B0605':'放射化学与辐射化学','B060501':'环境放射化学','B060502':'放射核素分析','B060503':'环境辐射化学','B060504':'放射计算化学','B060505':'放射性废物处理与处置','B060506':'放射性物质健康效应','B0606':'安全与防护化学','B060601':'化学品安全与防护','B060602':'生物安全与防护','B060603':'辐射安全与防护','B060604':'危险品检测','B07':'化学生物学','B0701':'分子探针','B070101':'分子探针设计与构建','B070102':'天然产物与分子探针','B070103':'分子探针与信号转导','B070104':'分子探针与生物分子示踪','B070105':'分子探针与组学技术','B070106':'分子探针与生物通讯','B070107':'分子探针与生态学效应','B0702':'生物分子的化学生物学','B070201':'蛋白质和多肽化学生物学','B070202':'核酸化学生物学','B070203':'糖化学生物学','B070204':'脂化学生物学','B070205':'金属蛋白','B070206':'微量元素化学生物学','B070207':'生物分子偶联与标记','B0703':'化学遗传学','B070301':'正向化学遗传学','B070302':'反向化学遗传学','B070303':'化学表观遗传学','B070304':'化学表观转录组学','B0704':'生物合成化学','B070401':'酶化学机制','B070402':'生物合成策略与机制','B070403':'活性与结构导向的生物合成','B070404':'合成生物学化学基础','B0705':'药物化学生物学','B070501':'先导化合物发现与结构优化','B070502':'靶向分子设计与作用机制','B070503':'靶标发现与确证','B070504':'药物载体与传输','B070505':'农用化学品发现与机制','B070506':'放射药物化学','B0706':'化学生物学理论与技术','B070601':'理论与计算化学生物学','B070602':'生物光电化学与热力学','B070603':'生物分子反应动力学','B070604':'生物体系自组装','B070605':'生物体系的纳米技术','B070606':'仿生化学与分子进化','B08':'化学工程与工业化学','B0801':'化工热力学','B080101':'化工基础数据与模型','B080102':'纳微尺度热力学','B080103':'表界面结构与现象','B080104':'分子模拟与计算','B080105':'平衡与非平衡热力学','B0802':'传递过程','B080201':'分子混合与传递','B080202':'化工流体力学','B080203':'传质与传热','B080204':'界面与限域传递','B080205':'非常规条件下的传递过程','B0803':'反应工程','B080301':'介尺度时空动态结构','B080302':'反应机理与反应动力学','B080303':'催化材料与催化剂工程','B080304':'反应器工程及新型反应器','B080305':'聚合反应方法与工程','B080306':'光','B080307':'反应与分离耦合','B0804':'分离工程','B080401':'分子辨识分离工程','B080402':'膜材料与膜分离','B080403':'结晶','B080404':'萃取','B080405':'机械与其他分离过程','B080406':'分离与传递耦合','B0805':'化工装备与过程强化','B080501':'新型化工装备','B080502':'装备腐蚀与防腐','B080503':'化工过程原位检测','B080504':'新材料','B080505':'外场强化及新型装备','B080506':'过程与系统耦合','B0806':'系统过程与化工安全','B080601':'化工大数据与虚拟过程','B080602':'智能化工系统','B080603':'化工过程模拟','B080604':'化工过程安全','B0807':'生物化工与轻化工','B080701':'合成生物技术与生物系统工程','B080702':'生化反应过程与分离工程','B080703':'工业生物催化','B080704':'食品与生物医药工程','B080705':'农林及海洋产物加工与转化','B080706':'皮革与造纸化工','B0808':'精细化工与绿色制造','B080801':'原料及中间体的绿色制造','B080802':'染料','B080803':'日用化学品','B080804':'电子信息化学品','B080805':'化工制药','B0809':'材料化工与产品工程','B080901':'材料的功能设计与化工制备','B080902':'材料应用化工基础','B080903':'化工产品加工过程与工艺','B080904':'产品全生命周期评价与循环利用','B0810':'能源化工','B081001':'煤与天然气化工','B081002':'石油化工','B081003':'生物质能源化工','B081004':'核与其他能源化工','B081005':'能源转换与储存工程技术','B0811':'资源与环境化工','B081101':'矿产资源高效利用','B081102':'低值与废弃资源的有效利用','B081103':'生物质资源高效转化','B081104':'绿色化工过程','B081105':'环境治理的化工过程','B081106':'生态化工',
    'C01':'微生物学','C0101':'微生物多样性','C010101':'细菌','C010102':'真菌多样性','C010103':'病毒及其他微生物多样性','C0102':'微生物生理与生物化学','C010201':'微生物生理','C010202':'微生物生物化学','C010203':'微生物结构与功能','C010204':'微生物代谢','C0103':'微生物遗传与育种','C010301':'微生物功能基因','C010302':'微生物遗传育种','C0104':'微生物学研究的新技术与新方法','C010401':'微生物分离培养新技术方法','C010402':'微生物组学研究技术方法','C010403':'微生物研究的其他新技术方法','C0105':'环境微生物学','C010501':'陆生环境微生物学','C010502':'水生环境微生物学','C010503':'人体及动物微生物学','C010504':'极端环境及其他环境微生物学','C0106':'病原细菌与放线菌生物学','C010601':'植物病原细菌与放线菌生物学','C010602':'动物病原细菌与放线菌生物学','C010603':'人类病原细菌与放线菌生物学','C0107':'病原真菌学','C010701':'植物病原真菌学','C010702':'动物病原真菌学','C010703':'人类病原真菌学','C0108':'病毒学','C010801':'病毒感染与宿主互作','C010802':'病毒传播机制','C010803':'病毒增殖与演化','C010804':'病毒生态与新病毒发现','C0109':'支原体','C010901':'支原体','C010902':'立克次氏体','C02':'植物学','C0201':'植物形态与发育','C020101':'植物结构与功能','C020102':'植物形态发生','C020103':'植物生长发育','C0202':'植物分类学','C020201':'种子植物分类','C020202':'孢子植物分类','C020203':'植物区系地理学','C0203':'植物进化生物学','C020301':'植物系统发生','C020302':'古植物学与孢粉学','C020303':'植物进化与发育','C020304':'传粉生物学与协同进化','C0204':'植物生理学','C020401':'植物光生物学','C020402':'植物共生与固氮','C020403':'水分与矿质元素代谢与运输','C020404':'有机物质合成与运输','C020405':'植物与其他生物互作','C020406':'植物与环境互作','C020407':'植物激素与生长调节物质','C020408':'植物次生代谢与调控','C0205':'植物生殖生物学','C020501':'无融合生殖与营养繁殖','C020502':'性别与花器官分化','C020503':'配子体与配子发生','C020504':'受精','C020505':'胚胎和胚乳发育','C020506':'种子贮藏与传播','C0206':'植物资源学','C020601':'植物资源发掘利用','C020602':'植物种质资源','C020603':'水生与湿地植物','C020604':'植物化学','C0207':'植物学研究的新技术','C03':'生态学','C0301':'分子生态学','C030101':'植物分子生态学','C030102':'动物分子生态学','C030103':'微生物分子生态学','C0302':'行为生态学','C030201':'昆虫行为生态学','C030202':'动物行为生态学','C0303':'生理生态学','C030301':'植物生理生态学','C030302':'动物生理生态学','C030303':'微生物生理生态学','C0304':'种群生态学','C030401':'植物种群生态学','C030402':'动物种群生态学','C030403':'微生物种群生态学','C0305':'群落生态学','C030501':'植物群落生态学','C030502':'动物群落生态学','C030503':'微生物群落生态学','C0306':'生态系统生态学','C030601':'农田生态学','C030602':'森林生态学','C030603':'草地与荒漠生态学','C030604':'湿地与内陆水体生态学','C030605':'海洋生态学','C030606':'城市生态学','C0307':'景观与区域生态学','C030701':'景观生态学','C030702':'区域生态学','C030703':'流域生态学','C0308':'全球变化生态学','C030801':'森林生态系统与全球变化','C030802':'湿地','C030803':'草原和荒漠生态系统与全球变化','C030804':'农田生态系统与全球变化','C0309':'生态学理论与方法','C0310':'污染生态学','C031001':'污染生态学','C031002':'毒理生态学','C031003':'污染与生态治理','C0311':'土壤生态学','C031101':'土壤物质循环过程生态学','C031102':'土壤食物网生态学','C031103':'根际生态学','C031104':'土壤退化与生态治理','C0312':'保护生物学与恢复生态学','C031201':'生物多样性','C031202':'保护生物学','C031203':'恢复生态学','C0313':'生态系统服务与生态安全','C031301':'转基因生物的生态安全','C031302':'生物入侵生态学','C031303':'生态系统服务','C031304':'生态灾害与风险防控','C0314':'进化生物学','C04':'动物学','C0401':'动物进化','C040101':'物种形成与灭绝','C040102':'协同进化','C040103':'适应性进化','C0402':'动物系统与分类','C040201':'动物分类学','C040202':'动物系统学','C040203':'动物地理学','C040204':'动物形态学','C0403':'动物生理与行为','C040301':'动物生理生化','C040302':'动物行为学','C0404':'动物繁殖与发育','C0405':'动物种群生物学','C0406':'昆虫学','C040601':'昆虫系统学','C040602':'昆虫行为学','C040603':'昆虫生理生化与毒理','C040604':'昆虫基因与功能','C040605':'昆虫资源与保护','C0407':'海洋动物学','C0408':'受胁动物保护与复壮','C0409':'动物资源与利用','C0410':'野生动物疫病与防控','C0411':'实验动物学','C041101':'实验动物标准化','C041102':'野生动物实验动物化','C041103':'实验动物模型','C05':'生物物理与生物化学','C0501':'分子生物物理','C050101':'生物分子结构测定与功能','C050102':'分子相互作用','C050103':'生物分子的动态特性','C050104':'单分子生物物理','C0502':'细胞生物物理','C050201':'生物膜结构与功能','C050202':'物质跨膜转运','C050203':'无膜自组装体系','C050204':'氧化还原与应激','C0503':'环境生物物理','C050301':'电磁辐射生物物理','C050302':'电离辐射生物物理与放射生物学','C050303':'声光电及压强生物物理','C050304':'空间生物学','C050305':'自由基生物学','C0504':'物理生物学','C050401':'生物大分子结构计算及理论预测','C050402':'生物系统的模拟与建模','C050403':'力学生物学','C050404':'生命现象中的热力学统计物理与软凝聚态物理','C050405':'生命现象中的其他物理问题','C0505':'系统生物学','C0506':'蛋白质与多肽生物化学','C0507':'代谢生物化学','C0508':'酶学','C0509':'糖生物化学','C0510':'脂质生物化学','C0511':'无机生物化学','C0512':'脱氧核糖核酸生物化学','C0513':'核糖核酸生物化学','C0514':'生物大分子修饰','C0515':'生物化学过程中的动态分析','C0516':'生物化学标记与定性定量','C0517':'环境生物化学','C06':'遗传学与生物信息学','C0601':'植物遗传学','C060101':'植物分子遗传','C060102':'植物细胞遗传','C060103':'植物数量遗传','C060104':'植物表观遗传','C0602':'动物遗传学','C060201':'动物分子遗传','C060202':'动物细胞遗传','C060203':'动物数量遗传','C060204':'动物表型与进化','C0603':'微生物遗传学','C060301':'原核微生物遗传','C060302':'真核微生物遗传','C060303':'微生物组与群体遗传学','C0604':'人类遗传学','C060401':'人类遗传的多样性','C060402':'人类起源与演化','C060403':'人类行为的遗传基础','C060404':'人类表型性状','C060405':'人类细胞与分子遗传','C060406':'遗传与变异','C0605':'基因组学','C060501':'基因组结构与变异','C060502':'比较基因组','C060503':'群体基因组','C060504':'宏基因组学','C060505':'基因组与性状','C060506':'基因组编辑与调控','C0606':'基因表达调控与表观遗传学','C060601':'组蛋白修饰及变体','C060602':'','C060603':'染色质装配与重塑','C060604':'染色质高维结构','C060605':'','C060606':'非编码','C060607':'转录与调控','C060608':'表观遗传操控','C0607':'生物信息学','C060701':'生物数据分析','C060702':'生物信息算法及工具','C060703':'生物数据整合与生物大数据','C060704':'生物网络与系统','C060705':'系统模拟与重建','C060706':'生物信息学研究新技术与新方法','C0608':'计算遗传学','C060801':'遗传学理论与规律','C060802':'统计遗传学','C060803':'遗传计算预测','C07':'细胞生物学','C0701':'细胞膜与细胞器','C0702':'细胞物质运输','C0703':'细胞骨架','C0704':'细胞增殖与细胞周期','C0705':'细胞生长与分化','C0706':'细胞命运与重编程','C0707':'细胞衰老','C0708':'细胞死亡','C0709':'细胞自噬','C0710':'细胞运动','C0711':'细胞代谢','C0712':'细胞应激与稳态','C0713':'细胞信号转导','C0714':'细胞间通讯与互作','C0715':'细胞极性与细胞连接','C0716':'细胞外基质与微环境','C0717':'细胞变异与功能失常','C0718':'单细胞与细胞谱系','C0719':'细胞生物学前沿与新体系','C08':'免疫学','C0801':'免疫分子的结构与功能','C0802':'免疫细胞的分化与功能','C0803':'免疫系统发育与衰老','C0804':'固有与适应性免疫应答','C0805':'自身免疫及免疫排斥','C0806':'免疫遗传及表观调控','C0807':'生殖免疫','C0808':'黏膜及区域免疫','C0809':'疫苗','C080901':'疫苗设计','C080902':'佐剂','C080903':'递送系统','C080904':'疫苗作用效应与机制','C0810':'抗体及其应用','C081001':'抗体重组与改型','C081002':'抗体工程','C081003':'人工抗体','C081004':'抗体的新应用','C0811':'免疫技术与方法','C0812':'病原生物的免疫应答与调控','C0813':'非感染性炎症与免疫','C0814':'神经免疫','C09':'神经科学与心理学','C0901':'神经科学','C090101':'分子神经生物学','C090102':'细胞神经生物学','C090103':'发育与进化神经生物学','C090104':'系统神经科学','C090105':'计算神经科学与神经信息学','C090106':'视觉神经生物学','C090107':'听觉神经生物学','C090108':'化学感受神经生物学','C090109':'触觉神经生物学','C090110':'痛觉神经生物学','C090111':'行为神经科学','C090112':'情感神经科学','C090113':'学习与记忆','C090114':'衰老神经生物学','C090115':'神经系统结构与功能异常','C090116':'神经科学研究的新技术和新方法','C090117':'神经科学研究的转化与交叉','C0902':'心理学','C090201':'认知心理学','C090202':'生理心理学','C090203':'医学心理学','C090204':'工程心理学','C090205':'发展心理学','C090206':'教育心理学','C090207':'社会心理学','C090208':'应用心理学','C090209':'健康心理学','C090210':'应激心理学','C090211':'运动心理学','C090212':'行为与决策心理学','C090213':'心理学研究方法与技术','C0903':'认知科学','C090301':'认知的脑结构基础','C090302':'认知的生物学基础','C090303':'语言认知','C090304':'认知模拟与人工智能','C090305':'认知障碍与认知干预','C10':'生物材料','C1001':'生物力学与生物流变学','C100101':'细胞','C100102':'肌骨组织与运动系统生物力学','C100103':'血液循环系统生物力学与生物流变学','C100104':'口腔及颌面生物力学','C100105':'其他生物力学','C1002':'生物材料','C100201':'生物材料与先进制造','C100202':'材料的生物相容性','C100203':'材料与机体相互作用','C100204':'生物材料与组织再生','C100205':'缓控释材料','C100206':'材料生物学','C1003':'组织工程学','C100301':'皮肤','C100302':'骨和软骨组织工程','C100303':'神经组织工程','C100304':'血管与心脏组织工程','C100305':'创伤修复与组织工程','C100306':'口腔组织工程','C100307':'其他器官','C100308':'工程化组织体外仿生构筑新技术','C100309':'干细胞扩增','C100310':'人工器官与模拟组织三维构建','C1004':'生物成像与生物电子学','C100401':'生物信号检测与分析','C100402':'图像处理','C100403':'生物传感','C1005':'生物仿生与人工智能','C100501':'仿生的生物学基础','C100502':'脑机接口','C100503':'生物学特征的表征及智能处理','C100504':'生物大数据处理','C1006':'纳米生物学','C100601':'纳米影像探针与生物检测','C100602':'纳米载体与递送','C100603':'纳米生物效应','C100604':'纳米生物安全性评价及技术','C100605':'其他纳米生物学与技术','C1007':'生物与医学工程新技术新方法','C100701':'器官芯片','C100702':'细胞与生物大分子工程','C100703':'生物制造与','C100704':'微纳制造与微流控技术','C100705':'大科学装置生物成像新技术','C11':'生理学与整合生物学','C1101':'细胞生理','C110101':'细胞电生理','C110102':'细胞膜生理功能','C110103':'细胞间相互作用','C1102':'循环系统','C1103':'血液系统','C1104':'呼吸系统','C1105':'消化系统','C1106':'泌尿系统','C1107':'内分泌系统','C1108':'生殖系统','C1109':'整合生理','C110901':'能量稳态调控','C110902':'应激','C110903':'神经','C110904':'组织','C1110':'营养生理学','C111001':'营养感应的调控及异常','C111002':'肠道菌群与营养调控','C1111':'代谢生理学','C111101':'糖','C111102':'肝脏代谢及异常','C111103':'微量元素的生理功能及代谢异常','C111104':'维生素的生理功能及代谢异常','C1112':'生物节律','C1113':'衰老','C1114':'运动生理','C111401':'运动系统结构','C111402':'运动能力的生理学基础','C111403':'运动与健康','C1115':'特殊环境生理','C1116':'比较生理学','C1117':'人体解剖与组织胚胎学','C1118':'系统与整合生物学','C12':'发育生物学与生殖生物学','C1201':'人类和动物发育','C120101':'早期胚胎发育','C120102':'器官发育的细胞谱系建立','C120103':'消化和呼吸器官及肾脏发育','C120104':'血液与免疫系统发育','C120105':'心血管系统发育及稳态','C120106':'神经系统发育','C120107':'肌肉骨骼及肢体发育','C120108':'神经嵴分化和颅颌面发育','C120109':'感觉器官','C120110':'其他组织器官的发育','C120111':'组织器官协同发育','C120112':'体内外环境与发育','C120113':'组织与器官再生','C1202':'人类和动物生殖','C120201':'性别决定与性器官发育','C120202':'原始生殖细胞及生殖干细胞','C120203':'女','C120204':'男','C120205':'受精','C120206':'母胎互作','C120207':'辅助生殖','C120208':'生殖异常与不育','C120209':'环境与生殖','C1203':'植物发育与生殖','C1204':'干细胞','C120401':'胚胎干细胞及诱导性多能干细胞','C120402':'成体干细胞与多潜能细胞','C120403':'细胞分化与去分化','C120404':'细胞转分化','C120405':'干细胞与微环境互作','C120406':'核移植及克隆胚胎','C120407':'植物干细胞','C1205':'发育生殖研究新体系','C13':'农学基础与作物学','C1301':'农学基础','C130101':'农业气象学','C130102':'农业信息学','C130103':'农业物料学','C130104':'农艺农机学','C130105':'农业生物环境工程学','C1302':'作物生理学','C130201':'作物生长发育生理','C130202':'作物产量生理','C130203':'作物品质生理','C130204':'作物逆境生理','C1303':'作物栽培与耕作学','C130301':'稻类作物栽培学','C130302':'麦类作物栽培学','C130303':'玉米栽培学','C130304':'油料作物栽培学','C130305':'棉麻类作物栽培学','C130306':'其他作物栽培学','C130307':'耕作学','C1304':'作物种质资源学','C130401':'稻类作物种质资源','C130402':'麦类作物种质资源','C130403':'玉米种质资源','C130404':'豆类作物种质资源','C130405':'油料作物种质资源','C130406':'棉麻类作物种质资源','C130407':'其他作物种质资源','C130408':'作物种质资源保护与保存','C1305':'作物遗传育种学','C130501':'稻类作物遗传育种学','C130502':'麦类作物遗传育种学','C130503':'玉米遗传育种学','C130504':'豆类作物遗传育种学','C130505':'油菜及其他油料作物遗传育种学','C130506':'棉麻类作物遗传育种学','C130507':'薯类作物遗传育种学','C130508':'糖料作物遗传育种学','C130509':'其他作物遗传育种学','C1306':'作物种子学','C14':'植物保护学','C1401':'植物病理学','C140101':'植物病害发生与预警','C140102':'植物真菌病害','C140103':'植物细菌病害','C140104':'植物病毒病害','C140105':'植物线虫病害','C140106':'植物卵菌病害','C140107':'植物其他病害','C140108':'植物免疫与抗病性','C1402':'农业昆虫学','C140201':'植物害虫发生与预警','C140202':'粮食作物害虫','C140203':'园艺作物害虫','C140204':'经济及其他作物害虫','C140205':'植物免疫与抗虫性','C1403':'农田草害','C140301':'农田杂草生物学','C140302':'农田杂草防控','C1404':'农田鼠害及其他有害生物','C1405':'植物化学保护','C140501':'农药活性化合物','C140502':'植物有害生物化学防治','C140503':'农药毒理学与有害生物抗药性','C140504':'农药环境学','C140505':'农药剂型加工与应用','C1406':'生物防治','C140601':'植物病害生物防治','C140602':'植物害虫生物防治','C140603':'其他有害生物的生物防治','C1407':'植物检疫与生物入侵','C1408':'植物保护新技术','C1409':'作物与生物因子互作','C140901':'作物与病原微生物互作','C140902':'作物与害虫互作','C140903':'作物与其他有害生物互作','C15':'园艺学与植物营养学','C1501':'果树学','C150101':'果树生理与栽培学','C150102':'果树种质资源与遗传育种学','C150103':'果树分子生物学','C1502':'蔬菜学','C150201':'蔬菜生理与栽培学','C150202':'蔬菜种质资源与遗传育种学','C150203':'蔬菜分子生物学','C150204':'瓜果学','C1503':'观赏园艺学','C150301':'观赏植物生理与栽培学','C150302':'观赏植物种质资源与遗传育种学','C150303':'观赏植物分子生物学','C1504':'茶学','C150401':'茶树生理与栽培学','C150402':'茶树种质资源与遗传育种学','C150403':'茶叶加工与品质形成','C1505':'园艺作物采后生物学','C1506':'食用真菌学','C150601':'食用菌生理与栽培学','C150602':'食用菌种质资源与遗传育种学','C1507':'设施园艺学','C150701':'设施园艺作物抗逆','C150702':'设施环境与作物互作','C1508':'植物营养基础','C150801':'植物营养遗传','C150802':'植物营养生理','C150803':'植物','C150804':'植物营养与环境胁迫','C150805':'植物营养与土壤健康','C1509':'肥料与施肥','C150901':'肥料学','C150902':'施肥学','C150903':'施肥与品质','C1510':'养分管理','C151001':'养分流动与调控','C151002':'农业废弃物养分循环与利用','C151003':'农田与区域养分管理','C16':'林学与草地科学','C1601':'森林资源学','C160101':'林下经济资源','C160102':'森林自然保护区','C1602':'森林信息学','C160201':'森林资源与信息技术','C160202':'森林资源健康与灾害监测','C1603':'木材物理学','C160301':'木材结构和性质','C160302':'木材保护和改良','C160303':'重组木材','C1604':'林产化学','C160401':'树木分泌物与提取物','C160402':'木质纤维利用基础','C160403':'树木组分化学与利用基础','C1605':'树木生物学','C160501':'树木生长发育','C160502':'树木抗逆生理学','C160503':'树木繁殖生物学','C1606':'森林土壤学','C160601':'森林土壤生物','C160602':'森林土壤有机质形成与养分循环','C1607':'森林培育学','C160701':'森林植被恢复与保持','C160702':'人工林培育','C160703':'种苗学','C1608':'森林经理学','C160801':'森林可持续发展','C160802':'森林碳汇经营','C1609':'森林保护学','C160901':'森林病理','C160902':'森林昆虫','C160903':'森林林火与其他灾害','C1610':'林木遗传育种学','C161001':'林木种质资源与林木育种','C161002':'林木遗传改良','C161003':'林木性状遗传与变异','C1611':'经济林学','C161101':'经济林重要性状形成','C161102':'经济林栽培生理','C161103':'经济林果实采后生物学','C1612':'园林学','C161201':'园林植物种质资源与遗传育种','C161202':'园林植物生物学与栽培学','C161203':'园林绿地规划设计与功能','C1613':'荒漠化与水土保持','C161301':'防护林学','C161302':'森林植被与水土保持','C161303':'植被与荒漠化','C1614':'竹学','C161401':'竹林与竹笋培育','C161402':'竹材利用','C1615':'草地科学','C161501':'草地过程与功能','C161502':'草种质资源与遗传育种','C161503':'草地保护','C161504':'牧草生理与栽培加工','C161505':'草地资源与利用','C161506':'草坪学','C17':'畜牧学','C1701':'畜牧学基础','C170101':'畜禽性状形成的基础','C170102':'畜禽遗传','C170103':'畜禽消化道微生物','C170104':'畜禽生态学','C1702':'畜禽种质资源','C170201':'家畜种质资源','C170202':'家禽种质资源','C170203':'犬及其他经济动物种质资源','C1703':'畜禽遗传育种学','C170301':'猪遗传育种','C170302':'家禽遗传育种','C170303':'反刍动物遗传育种','C170304':'犬及其他经济动物遗传育种','C170305':'畜禽育种新理论和新技术','C1704':'畜禽繁殖学','C170401':'畜禽生殖生理','C170402':'畜禽配子发生与胚胎发育','C170403':'畜禽繁殖调控新理论与新技术','C1705':'动物营养学','C170501':'猪营养','C170502':'家禽营养','C170503':'反刍动物营养','C170504':'其他家畜营养','C170505':'畜禽消化生理与营养','C1706':'饲料学','C170601':'饲料资源','C170602':'饲料','C170603':'饲料添加剂','C170604':'饲料生物技术','C170605':'饲料安全','C1707':'畜禽行为与福利学','C170701':'畜禽行为','C170702':'动物福利','C1708':'畜禽环境与设施','C170801':'畜禽养殖环境与健康','C170802':'畜禽养殖设施与智能化','C1709':'养蚕学','C170901':'蚕及桑柞资源与遗传育种','C170902':'蚕生理','C170903':'蚕桑生物技术','C1710':'养蜂学','C171001':'养蜂资源及遗传育种','C171002':'蜜蜂病理','C171003':'蜜蜂及蜂产品生物学基础','C18':'兽医学','C1801':'基础兽医学','C180101':'畜禽解剖学与组织胚胎学','C180102':'畜禽生理学与生物化学','C180103':'兽医病理学','C1802':'兽医微生物学','C180201':'兽医细菌学','C180202':'兽医病毒学','C180203':'其他兽医病原微生物学','C1803':'兽医免疫学','C180301':'兽医免疫生物学','C180302':'感染免疫学','C180303':'兽医疫苗学','C1804':'兽医寄生虫学','C180401':'寄生虫病原学','C180402':'寄生虫病流行病学','C180403':'寄生虫感染与免疫','C1805':'兽医传染病学','C180501':'传染病流行病学','C180502':'传染病的发生与传播','C180503':'传染病防控','C180504':'人兽共患病学','C1806':'中兽医学','C180601':'中兽医','C180602':'中兽药','C1807':'兽医药学','C180701':'兽医药理学','C180702':'兽医毒理学','C180703':'兽医药物学','C1808':'临床兽医学','C180801':'兽医临床诊断学','C180802':'兽医内科学','C180803':'兽医外科学','C180804':'兽医产科学','C1809':'兽医公共卫生学','C19':'水产学','C1901':'水产基础生物学','C190101':'水产生物生理学','C190102':'水产生物繁殖与发育','C190103':'水产生物遗传','C190104':'水产生物行为学','C190105':'水产生物环境生物学','C1902':'水产生物遗传育种学','C190201':'鱼类遗传育种学','C190202':'甲壳类遗传育种学','C190203':'贝类遗传育种学','C190204':'藻类遗传育种学','C190205':'特色水产生物遗传育种学','C1903':'渔业资源与保护生物学','C190301':'水产生物多样性与保护生物学','C190302':'渔业资源评估与增殖','C190303':'渔业环境效应与生态修复','C1904':'水产动物营养与饲料学','C190401':'水产动物营养学','C190402':'水产动物饲料资源与饲料学','C190403':'水产生物饵料与培养','C1905':'水产养殖学','C190501':'鱼类养殖学','C190502':'甲壳类养殖学','C190503':'贝类养殖学','C190504':'藻类养殖学','C190505':'特色水产生物养殖学','C1906':'水产生物免疫学与病害控制','C190601':'水产免疫生物学','C190602':'水产生物病原学与流行病学','C190603':'水产生物病理学与药理学','C190604':'水产生物病害免疫防控','C1907':'养殖与渔业工程学','C190701':'水产综合养殖系统','C190702':'水产养殖设施与养殖工程','C190703':'水产捕捞理论与技术','C1908':'水产生物研究的新技术和新方法','C20':'食品科学','C2001':'食品原料学','C200101':'果蔬食品原料','C200102':'粮油食品原料','C200103':'畜产食品原料','C200104':'水产食品原料','C200105':'食品添加剂及食品配料','C200106':'食品新原料','C2002':'食品生物化学','C200201':'食品酶学','C200202':'食品蛋白质','C200203':'食品碳水化合物','C200204':'食品脂质','C200205':'食品其他成分','C2003':'食品微生物学','C200301':'食品微生物学基础','C200302':'乳酸菌与益生菌','C200303':'食品发酵','C200304':'食品酿造','C2004':'食品营养学','C200401':'食品营养学基础','C200402':'膳食与营养','C200403':'食品组分相互作用','C200404':'食品功能因子','C200405':'食品与肠道菌群','C2005':'食品加工的生物学基础','C200501':'果蔬食品','C200502':'畜产食品','C200503':'水产食品','C200504':'粮油食品','C200505':'糖工程','C200506':'其他食品','C2006':'食品贮藏与保鲜','C200601':'粮油及其食品储藏','C200602':'果品贮藏与保鲜','C200603':'蔬菜贮藏与保鲜','C200604':'畜产食品贮藏与保鲜','C200605':'水产食品贮藏与保鲜','C200606':'食用菌及其他食品贮藏与保鲜','C2007':'食品安全与质量控制','C200701':'食品检测目标物分离与富集','C200702':'食品理化检测','C200703':'食品生物学检测','C200704':'食品真实性检测与溯源','C200705':'食品化学危害与控制','C200706':'食品微生物危害与控制','C200707':'食品生物毒素及其他生物源危害与控制','C200708':'食品加工过程中有害产物控制','C200709':'食品安全风险评估理论与方法','C2008':'食品风味化学与感官评价','C200801':'食品风味物质','C200802':'食品风味理论与分析方法','C200803':'食品风味与食品组分','C200804':'食品风味感官评价与品质','C2009':'食品科学研究的新技术与新方法','C200901':'食品物性学','C200902':'食品生物技术','C200903':'食品工程学','C21':'分子生物学与生物技术','C2101':'分子生物学','C210101':'分子生物学基础理论','C210102':'分子生物学研究的新方法','C2102':'合成生物学','C210201':'生物元件与模块的设计与合成','C210202':'合成基因线路的设计与合成','C210203':'人工染色体与细胞器的设计与合成','C210204':'人工细胞与多细胞体系的设计与合成','C210205':'人工生物系统的定量表征与模拟','C210206':'微生物合成与智能制造','C210207':'合成生物学新技术','C2103':'组学技术','C210301':'蛋白质组学','C210302':'代谢组学','C210303':'糖组学','C210304':'核酸组学','C210305':'脂质组学','C210306':'组学数据的标准化与分析整合','C2104':'生物分子检测技术','C210401':'生物分子富集与分离技术','C210402':'生物分子光学分析技术','C210403':'生物分子电分析技术','C210404':'生物质谱和核磁分析新技术','C210405':'稳定同位素示踪分析新技术','C210406':'核酸','C210407':'生物分子的原位与活体分析技术','C2105':'基因编辑与生物分子操控技术','C210501':'基因','C210502':'','C210503':'蛋白质操控','C210504':'细胞状态操控','C210505':'生物分子递送技术','C2106':'蛋白质与疫苗工程','C210601':'蛋白质分子设计与进化技术','C210602':'蛋白质固定化与存储技术','C210603':'抗体发现','C210604':'新型疫苗与佐剂的设计和合成','C2107':'单分子与单细胞技术','C210701':'核酸单分子技术','C210702':'蛋白质单分子技术','C210703':'单细胞表型分析与示踪技术','C210704':'单细胞分离与培养技术','C210705':'单细胞组学技术','C210706':'复杂系统的单分子与单细胞技术','C2108':'干细胞与组织工程技术','C210801':'仿生组织与类器官','C210802':'组织状态模拟与微环境仿真','C210803':'组织生物活性材料','C210804':'组织培养与组织器官芯片','C210805':'干细胞与器官功能重建','C210806':'个体再生','C2109':'生物影像与技术','C210901':'探针与标记技术','C210902':'显微成像技术','C210903':'活体成像技术','C210904':'生物影像分析技术','C210905':'新型成像技术','C2110':'人工智能生物学','C211001':'生物动力学模拟','C211002':'生物网络与建模','C211003':'高性能计算与并行计算','C211004':'生物大数据的管理与挖掘','C211005':'人工智能生物技术','C2111':'应用生物技术','C211101':'医药生物技术','C211102':'工业生物技术','C211103':'农业生物技术','C211104':'环境生物技术','C211105':'生物资源技术','C211106':'生物安全技术','C2112':'其他前沿生物技术','C2113':'生命科学基础研究相关的试剂开发与新仪器研制',
    'D01':'地理学','D0101':'自然地理学','D010101':'地貌学','D010102':'应用气候学','D010103':'水文学与水循环','D010104':'生物与土壤地理学','D010105':'冰冻圈地理学','D010106':'地理环境演化','D010107':'综合自然地理学','D0102':'人文地理学','D010201':'经济地理学','D010202':'社会','D010203':'城市地理学','D010204':'乡村地理学','D0103':'景观地理学','D0104':'自然资源管理','D010401':'水资源与流域管理','D010402':'土地资源与土地系统','D010403':'自然资源评价','D010404':'自然资源利用与规划','D0105':'区域可持续发展','D010501':'人地系统耦合机理与模拟','D010502':'资源环境与可持续发展','D010503':'经济发展与环境质量','D010504':'生态系统服务','D010505':'可持续性评估','D0106':'遥感机理与方法','D0107':'地理信息系统','D010701':'空间数据组织与管理','D010702':'遥感信息分析与应用','D010703':'空间定位数据分析与应用','D0108':'测量与地图学','D02':'地质学','D0201':'古生物学和古生态学','D020101':'古生物学','D020102':'古人类学','D020103':'古生态学','D020104':'地球环境与生命演化','D0202':'地层学','D0203':'矿物学','D0204':'岩石学','D0205':'矿床学','D0206':'沉积学和盆地动力学','D0207':'石油','D0208':'煤地质学','D0209':'第四纪地质学','D0210':'前寒武纪地质学','D0211':'构造地质学与活动构造','D021101':'构造地质学','D021102':'活动构造','D021103':'构造物理与流变学','D0212':'大地构造学','D0213':'水文地质','D0214':'工程地质','D0215':'数学地质学与遥感地质学','D0216':'火山学与地热地质','D0217':'生物地质学','D0218':'行星地质学','D0219':'勘探技术与地质钻探学','D03':'地球化学','D0301':'同位素地球化学','D0302':'微量元素地球化学','D0303':'岩石地球化学','D0304':'矿床地球化学','D0305':'同位素和化学年代学','D0306':'实验地球化学和计算地球化学','D0307':'宇宙化学与比较行星学','D0308':'气体地球化学','D0309':'油气地球化学','D0310':'有机地球化学','D0311':'沉积地球化学','D0312':'生物地球化学','D0313':'纳米与分子地球化学','D0314':'化学地球动力学','D04':'地球物理学和空间物理学','D0401':'大地测量学','D040101':'物理大地测量学','D040102':'动力大地测量学','D040103':'卫星大地测量学','D0402':'地震学','D0403':'地磁学','D0404':'地球电磁学','D0405':'重力学','D0406':'地热学','D0407':'地球内部物理学','D0408':'地球动力学','D0409':'应用地球物理学','D040901':'勘探地球物理学','D040902':'城市地球物理','D0410':'空间物理','D041001':'高层大气物理学','D041002':'电离层物理学','D041003':'磁层物理学','D041004':'太阳大气和行星际物理学','D041005':'宇宙线物理学','D041006':'行星物理学','D0411':'地球物理学和空间物理学实验与仪器','D0412':'空间环境和空间天气','D0413':'工程测量学','D05':'大气科学','D0501':'天气学','D0502':'气候与气候系统','D0503':'古气候学','D0504':'大气动力学','D0505':'大气物理学','D0506':'大气化学','D0507':'生态气象','D0508':'行星大气','D0509':'大气观测','D0510':'大气数据与信息科学','D0511':'大气数值模式发展','D0512':'地球系统模式发展','D0513':'气候变化及影响与应对','D0514':'大气环境与健康气象','D0515':'应用气象学','D06':'海洋科学','D0601':'物理海洋学','D0602':'海洋化学','D0603':'海洋地质学与地球物理学','D0604':'生物海洋学与海洋生物资源','D0605':'海洋生态学与环境科学','D0606':'河口海岸学','D0607':'海洋遥感','D0608':'海洋物理与观测探测技术','D0609':'海洋数据科学与信息系统','D0610':'海洋系统与全球变化','D0611':'海洋工程与环境效应','D0612':'海洋灾害与防灾减灾','D0613':'海洋能源与资源','D0614':'海陆统筹与可持续发展','D0615':'极地科学','D07':'环境地球科学','D0701':'土壤学','D070101':'土壤圈形成与演化','D070102':'土壤物理学','D070103':'土壤化学','D070104':'土壤生物学','D070105':'土壤侵蚀与水土保持','D070106':'土壤肥力与土壤养分循环','D070107':'土壤污染与修复','D070108':'土壤质量与食物安全','D0702':'环境水科学','D070201':'地表水环境','D070202':'地下水环境','D070203':'环境水循环','D0703':'环境大气科学','D0704':'环境生物学','D070401':'环境生态学','D070402':'环境微生物学','D070403':'生态毒理学','D0705':'工程地质环境与灾害','D0706':'环境地质学','D0707':'环境地球化学','D070701':'环境生物地球化学','D070702':'环境有机地球化学','D0708':'污染物行为过程及其环境效应','D070801':'污染物迁移','D070802':'污染物生物有效性与生态毒理','D070803':'污染物区域空间过程与生态风险','D070804':'污染物环境与健康风险','D0709':'第四纪环境','D0710':'环境变化与预测','D0711':'区域环境质量与安全','D071101':'区域环境质量综合评估','D071102':'自然灾害风险评估与公共安全','D071103':'重大工程活动的影响','D071104':'生态恢复及其环境效应',
    'E01':'金属材料','E0101':'金属材料设计','E0102':'金属材料制备与加工','E0103':'金属材料使役行为与表面工程','E0104':'金属结构材料与力学行为','E0105':'金属基复合材料与结构功能一体化','E0106':'金属低维与亚稳材料','E0107':'金属功能材料','E0108':'金属能源与环境材料','E0109':'金属信息功能材料','E0110':'金属生物与仿生材料','E02':'无机非金属材料','E0201':'人工晶体与玻璃材料','E0202':'无机非金属基础材料','E0203':'碳素材料与超硬材料','E0204':'结构陶瓷','E0205':'无机非金属基复合材料','E0206':'功能陶瓷','E0207':'无机非金属半导体与信息功能材料','E0208':'无机非金属能量转换与存储材料','E0209':'无机非金属类高温超导与磁性材料','E0210':'无机非金属类生物材料','E0211':'其他无机非金属材料','E03':'有机高分子材料','E0301':'高分子材料合成与改性','E0302':'高分子材料物理','E0303':'高分子材料加工与成型','E0304':'通用高分子材料','E0305':'高分子共混与复合材料','E0306':'高分子材料与环境','E0307':'智能与仿生材料','E0308':'生物医用有机高分子材料','E0309':'光电磁功能有机高分子材料','E0310':'其他有机高分子功能材料','E04':'矿业与冶金工程','E0401':'油气井工程','E0402':'油气开采','E0403':'油气储存与输送','E0404':'矿山开采基础理论','E0405':'矿山开采工程','E0406':'智能矿山','E0407':'矿山修复工程','E0408':'安全科学与工程','E0409':'矿物工程与物质分离','E0410':'冶金物理化学与冶金原理','E0411':'钢铁冶金','E0412':'有色金属冶金','E0413':'粉末冶金与粉体工程','E0414':'材料冶金加工','E0415':'资源循环利用','E05':'机械设计与制造','E0501':'机器人与机构学','E0502':'传动与驱动','E0503':'机械动力学','E0504':'机械结构强度学','E0505':'机械摩擦学与表面技术','E0506':'机械设计学','E0507':'机械仿生学与生物制造','E0508':'成形制造','E0509':'加工制造','E0510':'制造系统与智能化','E0511':'机械测试理论与技术','E0512':'微纳机械系统','E06':'工程热物理与能源利用','E0601':'工程热力学','E0602':'内流流体力学','E0603':'传热传质学','E0604':'燃烧学','E0605':'多相流热物理学','E0606':'热物性与热物理测试技术','E0607':'可再生能源与新能源利用中的工程热物理问题','E07':'电气科学与工程','E0701':'电磁场与电路','E0702':'超导与电工材料','E0703':'电机及其系统','E0704':'电力系统与综合能源','E0705':'高电压与放电','E0706':'电力电子学','E0707':'电能存储与应用','E0708':'生物电磁技术','E08':'建筑与土木工程','E0801':'建筑学','E0802':'城乡规划','E0803':'建筑物理','E0804':'工程结构','E0805':'工程材料','E0806':'工程建造与服役','E0807':'岩土与基础工程','E0808':'地下与隧道工程','E0809':'道路与轨道工程','E0810':'工程防灾','E09':'水利工程','E0901':'工程水文与水资源利用','E0902':'农业水利与农村水利','E0903':'水力学与河流动力学','E0904':'水力机械及系统','E0905':'水工岩土工程','E0906':'水工结构','E10':'环境工程','E1001':'饮用水工程','E1002':'城市污水处理与资源化','E1003':'工业水处理与回用','E1004':'城乡水系统与生态循环','E1005':'空气污染控制','E1006':'固废资源转化与安全处置','E1007':'环境污染治理与修复','E1008':'区域与城市生态环境系统工程','E1009':'生态环境风险控制','E11':'海洋工程','E1101':'海岸工程与海洋工程','E1102':'船舶工程','E1103':'海洋技术','E1104':'航海与海事技术','E12':'交通与运载工程','E1201':'交通系统分析理论','E1202':'交通规划与设计','E1203':'交通系统控制','E1204':'交通安全与环境','E1205':'运载工具设计基础','E1206':'运载系统动力学','E1207':'运载系统智能化','E1208':'运载系统运用工程','E13':'新概念材料与材料共性科学','E1301':'材料设计与表征新方法','E1302':'新型材料制备技术与数字制造','E1303':'材料多功能集成与器件','E1304':'新型复合与杂化材料','E1305':'新概念材料','E1306':'先进制造关键材料','E1307':'关键工程材料',
    'F01':'电子学与信息系统','F0101':'信息论','F0102':'信息系统与系统安全','F0103':'通信理论与系统','F0104':'通信网络','F0105':'移动通信','F0106':'空天通信','F0107':'海上和水下通信','F0108':'多媒体通信','F0109':'光通信','F0110':'量子通信与量子信息处理','F0111':'信号理论与信号处理','F0112':'雷达原理与技术','F0113':'信息获取与处理','F0114':'探测与成像','F0115':'水下信息感知与处理','F0116':'图像信息处理','F0117':'多媒体信息处理','F0118':'电路与系统','F0119':'电磁场与波','F0120':'太赫兹理论与技术','F0121':'微波光子学','F0122':'物理电子学','F0123':'敏感电子学与传感器','F0124':'生物电子学与生物信息处理','F0125':'医学信息检测与处理','F0126':'电子信息与其他领域交叉','F02':'计算机科学','F0201':'计算机科学的基础理论','F0202':'系统软件','F0203':'软件理论','F0204':'计算机系统结构与硬件技术','F0205':'网络与系统安全','F0206':'信息安全','F0207':'计算机网络','F0208':'物联网及其他新型网络','F0209':'计算机图形学与虚拟现实','F0210':'计算机图像视频处理与多媒体技术','F0211':'信息检索与社会计算','F0212':'数据科学与大数据计算','F0213':'生物信息计算与数字健康','F0214':'新型计算及其应用基础','F0215':'计算机与其他领域交叉','F03':'自动化','F0301':'控制理论与技术','F0302':'控制系统与应用','F0303':'系统建模理论与仿真技术','F0304':'系统工程理论与技术','F0305':'生物','F0306':'自动化检测技术与装置','F0307':'导航','F0308':'智能制造自动化系统理论与技术','F0309':'机器人学与智能系统','F0310':'人工智能驱动的自动化','F0311':'新兴领域的自动化理论与技术','F04':'半导体科学与信息器件','F0401':'半导体材料','F0402':'集成电路设计','F0403':'半导体光电子器件与集成','F0404':'半导体电子器件与集成','F0405':'半导体器件物理','F0406':'集成电路器件','F0407':'微纳机电器件与控制系统','F0408':'新型信息器件','F0409':'半导体与其他领域交叉','F05':'光学和光电子学','F0501':'光学信息获取','F0502':'光子与光电子器件','F0503':'传输与交换光子器件','F0504':'红外与太赫兹物理及技术','F0505':'非线性光学','F0506':'激光','F0507':'光谱信息学','F0508':'应用光学','F0509':'光学和光电子材料','F0510':'空间','F0511':'生物','F0512':'能源与照明光子学','F0513':'微纳光子学','F0514':'光子集成技术与器件','F0515':'量子光学','F0516':'交叉学科中的光学问题','F06':'人工智能','F0601':'人工智能基础','F0602':'复杂性科学与人工智能理论','F0603':'机器学习','F0604':'机器感知与机器视觉','F0605':'模式识别与数据挖掘','F0606':'自然语言处理','F0607':'知识表示与处理','F0608':'智能系统与人工智能安全','F0609':'认知与神经科学启发的人工智能','F0610':'交叉学科中的人工智能问题','F07':'交叉学科中的信息科学','F0701':'教育信息科学与技术','H1802':'fMRI 与脑、脊髓功能异常检测',
    'G01':'管理科学与工程','G0101':'管理理论与研究方法论','G0102':'运筹与管理','G0103':'决策理论与方法','G0104':'博弈理论与方法','G0105':'评价理论与方法','G0106':'预测理论与方法','G0107':'管理统计理论与方法','G0108':'管理心理与行为','G0109':'管理系统工程','G010901':'管理系统分析','G010902':'管理系统计算与仿真','G010903':'管理系统复杂性','G0110':'工业工程与管理','G0111':'物流与供应链理论','G0112':'服务科学与工程','G0113':'系统可靠性与管理','G0114':'信息系统与管理','G011401':'信息系统及其管理','G011402':'决策支持系统','G011403':'数据挖掘与商务分析','G0115':'知识管理','G0116':'风险管理','G0117':'金融工程','G0118':'工程管理','G0119':'交通运输管理','G02':'工商管理','G0201':'战略管理','G0202':'组织理论与组织行为','G020201':'组织理论','G020202':'组织行为','G0203':'企业技术管理与创新管理','G0204':'人力资源管理','G0205':'财务管理','G0206':'会计与审计','G0207':'市场营销','G020701':'营销模型','G020702':'消费者行为','G020703':'营销战略','G0208':'生产与质量管理','G020801':'生产管理','G020802':'质量管理','G0209':'企业信息管理','G020901':'企业信息资源管理','G020902':'商务智能','G0210':'电子商务','G0211':'运营管理','G021101':'企业物流与供应链管理','G021102':'服务管理','G0212':'项目管理','G0213':'创业管理','G0214':'国际商务与跨文化管理','G03':'经济科学','G0301':'博弈论与信息经济','G0302':'行为经济与实验经济','G0303':'计量经济与经济计算','G0304':'经济发展与贸易','G030401':'经济增长与发展','G030402':'贸易经济','G0305':'货币政策与财税政策','G0306':'金融管理','G030601':'银行体系管理','G030602':'金融市场管理','G030603':'金融创新管理','G0307':'人口资源环境经济与劳动经济','G030701':'劳动经济','G030702':'人口资源环境经济','G0308':'农林经济管理','G030801':'林业经济管理','G030802':'农业经济管理','G030803':'农村改革与发展','G030804':'食物经济管理','G0309':'区域经济与产业经济','G030901':'区域经济管理','G030902':'产业经济管理','G04':'宏观管理与政策','G0401':'公共管理','G040101':'公共管理基础理论','G040102':'政府组织管理','G040103':'社会与区域治理','G0402':'政策科学理论与方法','G0403':'非营利组织管理','G0404':'科技管理与政策','G040401':'科学计量学与科技评价','G040402':'科研管理','G040403':'知识产权管理','G0405':'创新管理与政策','G0406':'卫生管理与政策','G040601':'卫生政策','G040602':'药事管理','G040603':'医院管理','G040604':'社区卫生管理','G040605':'健康服务管理','G040606':'中医药管理与政策','G0407':'教育管理与政策','G0408':'文化与休闲产业管理','G0409':'公共安全与危机管理','G0410':'社会福利管理','G0411':'环境与生态管理','G0412':'资源管理与政策','G0413':'区域发展管理','G041301':'区域发展战略管理','G041302':'城镇发展与管理','G0414':'信息资源管理','G041401':'图书情报档案管理','G041402':'社会与政府信息资源管理','G0415':'电子政务',
    'H01':'呼吸系统','H0101':'肺及气道结构','H0102':'呼吸系统遗传性疾病','H0103':'呼吸调控异常','H0104':'呼吸系统炎症与感染','H0105':'呼吸系统免疫性疾病及变应性肺疾病','H0106':'气道重塑与气道疾病','H0107':'支气管哮喘','H0108':'慢性阻塞性肺疾病','H0109':'肺循环及肺血管疾病','H0110':'间质性肺疾病','H0111':'急性肺损伤和急性呼吸窘迫综合征','H0112':'呼吸衰竭与呼吸支持','H0113':'睡眠呼吸障碍','H0114':'纵隔与胸膜疾病','H0115':'胸廓','H0116':'肺移植和肺保护','H0117':'呼吸系统疾病诊疗新技术','H0118':'呼吸系统疾病其他科学问题','H02':'循环系统','H0201':'心脏结构与功能异常','H0202':'循环系统遗传性疾病','H0203':'心肌细胞','H0204':'心脏发育异常与先天性心脏病','H0205':'心电活动异常与心律失常','H0206':'冠状动脉性心脏病','H0207':'肺源性心脏病','H0208':'心肌炎和心肌病','H0209':'感染性心内膜炎','H0210':'心脏瓣膜疾病','H0211':'心包疾病','H0212':'心力衰竭','H0213':'心脏','H0214':'血压调节异常与高血压病','H0215':'动脉粥样硬化与动脉硬化','H0216':'主动脉疾病','H0217':'周围血管疾病','H0218':'淋巴管与淋巴循环疾病','H0219':'微循环与休克','H0220':'血管发生异常及血管结构与功能异常','H0221':'循环系统免疫相关疾病','H0222':'循环系统疾病诊疗新技术','H0223':'循环系统疾病其他科学问题','H03':'消化系统','H0301':'消化系统发育异常','H0302':'消化系统遗传性疾病','H0303':'消化道结构与功能异常','H0304':'肝胆胰结构与功能异常','H0305':'腹壁','H0306':'消化道内环境紊乱','H0307':'消化道动力异常及功能性胃肠病','H0308':'消化系统内分泌及神经体液调节异常','H0309':'胃酸分泌异常及酸相关性疾病','H0310':'胃肠道免疫相关疾病','H0311':'消化系统血管及循环障碍性疾病','H0312':'胃肠道及腹腔感染性疾病','H0313':'肝胆胰免疫及相关疾病','H0314':'肝脏代谢障碍及相关疾病','H0315':'药物','H0316':'炎性及感染性肝病','H0317':'肝纤维化','H0318':'肝再生','H0319':'胆石成因','H0320':'胰腺外分泌功能异常与胰腺炎','H0321':'消化系统器官移植','H0322':'消化系统疾病诊疗新技术','H0323':'消化系统疾病其他科学问题','H04':'生殖系统','H0401':'女性生殖系统结构','H0402':'女性生殖系统损伤与修复','H0403':'女性生殖系统炎症与感染','H0404':'女性生殖内分泌异常及相关疾病','H0405':'女性生殖系统遗传性疾病','H0406':'子宫内膜异位症与子宫腺肌症','H0407':'女性盆底功能障碍','H0408':'女性性功能障碍','H0409':'乳腺结构','H0410':'男性生殖系统结构','H0411':'男性生殖系统损伤与修复','H0412':'男性生殖系统炎症与感染','H0413':'男性生殖内分泌异常及相关疾病','H0414':'男性生殖系统遗传性疾病','H0415':'男性性功能障碍','H0416':'卵子发生与受精异常','H0417':'胚胎着床及早期胚胎发育异常','H0418':'胎盘结构与功能异常','H0419':'胎儿发育与产前诊断','H0420':'妊娠及妊娠相关性疾病','H0421':'分娩与产褥','H0422':'新生儿相关疾病','H0423':'避孕','H0424':'精子发生异常与男性不育','H0425':'女性不孕不育与辅助生殖','H0426':'生殖医学工程','H0427':'生殖免疫相关疾病','H0428':'生殖系统移植','H0429':'生殖系统','H0430':'生殖系统','H05':'泌尿系统','H0501':'泌尿系统结构','H0502':'泌尿系统遗传性疾病','H0503':'泌尿系统损伤与修复','H0504':'泌尿系统感染','H0505':'泌尿系统免疫相关疾病','H0506':'泌尿系统结石','H0507':'肾脏物质转运异常','H0508':'肾脏内分泌功能异常','H0509':'原发性肾脏疾病','H0510':'继发性肾脏疾病','H0511':'肾衰竭','H0512':'肾移植','H0513':'前列腺疾病','H0514':'膀胱疾病','H0515':'尿动力学','H0516':'血液净化和替代治疗','H0517':'泌尿系统疾病诊疗新技术','H0518':'泌尿系统疾病其他科学问题','H06':'运动系统','H0601':'运动系统结构','H0602':'运动系统遗传性疾病','H0603':'运动系统免疫相关疾病','H0604':'骨','H0605':'骨','H0606':'骨','H0607':'骨','H0608':'骨','H0609':'骨','H0610':'骨','H0611':'运动系统畸形与矫正','H0612':'运动系统疾病诊疗新技术','H0613':'运动系统疾病其他科学问题','H07':'内分泌系统','H0701':'松果体','H0702':'甲状腺','H0703':'肾上腺发育及结构异常','H0704':'胰岛发育','H0705':'内分泌系统炎症与感染','H0706':'内分泌系统遗传性疾病','H0707':'内分泌系统免疫相关疾病','H0708':'松果体','H0709':'甲状腺','H0710':'肾上腺疾病及功能异常','H0711':'糖尿病发生的遗传和环境因素','H0712':'血糖调控异常与胰岛素抵抗','H0713':'糖尿病','H0714':'其他组织的内分泌功能异常','H0715':'甲状腺和甲状旁腺移植','H0716':'能量代谢调节异常及肥胖','H0717':'代谢综合征','H0718':'糖代谢异常','H0719':'脂代谢异常','H0720':'脂肪细胞分化及功能异常','H0721':'氨基酸代谢异常','H0722':'核酸代谢异常','H0723':'水','H0724':'微量元素','H0725':'钙磷代谢异常','H0726':'骨转换','H0727':'营养不良与营养支持','H0728':'遗传性代谢缺陷','H0729':'内分泌系统疾病','H0730':'内分泌系统疾病','H08':'血液系统','H0801':'造血','H0802':'造血相关器官结构及功能异常','H0803':'红细胞异常及相关疾病','H0804':'白细胞异常及相关疾病','H0805':'血小板异常及相关疾病','H0806':'再生障碍性贫血和骨髓衰竭','H0807':'骨髓增生异常综合征','H0808':'骨髓增殖性疾病','H0809':'血液系统免疫相关疾病','H0810':'血液系统感染性疾病','H0811':'出血','H0812':'白血病','H0813':'造血干细胞移植及并发症','H0814':'血型与输血','H0815':'遗传性血液病','H0816':'血液系统疾病诊疗新技术','H0817':'血液系统疾病其他科学问题','H0818':'淋巴瘤及其他淋巴增殖性疾病','H0819':'骨髓瘤及其他浆细胞疾病','H09':'神经系统和精神疾病','H0901':'意识障碍','H0902':'认知功能障碍','H0903':'躯体感觉','H0904':'运动调节与运动障碍','H0905':'神经发育','H0906':'脑血管结构','H0907':'神经免疫调节异常及神经免疫相关疾病','H0908':'神经系统屏障和脑脊液异常及相关疾病','H0909':'神经系统炎症及感染性疾病','H0910':'脑','H0911':'周围神经','H0912':'神经变性','H0913':'神经电活动异常与发作性疾病','H0914':'脑功能保护','H0915':'节律调控与节律紊乱','H0916':'睡眠与睡眠障碍','H0917':'器质性精神疾病','H0918':'物质依赖和其他成瘾性障碍','H0919':'精神分裂症和其他精神障碍','H0920':'神经症和应激相关障碍','H0921':'心境障碍','H0922':'人格障碍','H0923':'儿童和青少年精神障碍','H0924':'其他精神障碍与精神卫生问题','H0925':'精神疾病的心理测量和评估','H0926':'心理咨询与心理治疗','H0927':'危机干预','H0928':'神经系统和精神疾病诊疗新技术','H0929':'神经系统和精神疾病其他科学问题','H10':'医学免疫学','H1001':'免疫器官','H1002':'免疫应答异常','H1003':'免疫反应相关因子与疾病','H1004':'免疫识别','H1005':'炎症','H1006':'器官移植与移植免疫','H1007':'超敏反应性疾病','H1008':'自身免疫性疾病','H1009':'继发及原发性免疫缺陷性疾病','H1010':'固有免疫异常','H1011':'神经内分泌免疫异常','H1012':'黏膜免疫疾病','H1013':'疾病的系统免疫学','H1014':'疫苗和佐剂研究','H1015':'免疫相关疾病诊疗新技术','H1016':'免疫相关疾病其他科学问题','H11':'皮肤及其附属器','H1101':'皮肤形态','H1102':'皮肤遗传及相关疾病','H1103':'皮肤免疫性疾病','H1104':'皮肤感染','H1105':'非感染性皮肤病','H1106':'皮肤附属器及相关疾病','H1107':'皮肤及其附属器疾病诊疗新技术','H1108':'皮肤及其附属器疾病其他科学问题','H12':'眼科学','H1201':'角膜及眼表疾病','H1202':'晶状体与白内障','H1203':'巩膜','H1204':'青光眼','H1205':'视网膜','H1206':'视觉','H1207':'全身疾病眼部表现','H1208':'眼遗传性疾病','H1209':'眼组织移植','H1210':'眼科疾病诊疗新技术','H1211':'眼科疾病其他科学问题','H13':'耳鼻咽喉头颈科学','H1301':'嗅觉','H1302':'咽喉及颈部疾病','H1303':'耳及侧颅底疾病','H1304':'听觉异常与平衡障碍','H1305':'耳鼻咽喉遗传与发育相关疾病','H1306':'耳鼻咽喉疾病诊疗新技术','H1307':'耳鼻咽喉疾病其他科学问题','H14':'口腔颅颌面科学','H1401':'口腔颅颌面组织生长发育及牙再生','H1402':'颅颌面部骨','H1403':'口腔颌面部遗传性疾病和发育畸形及软组织缺损修复','H1404':'牙体牙髓及根尖周组织疾病','H1405':'牙周及口腔黏膜疾病','H1406':'唾液','H1407':'味觉','H1408':'牙缺损','H1409':'口腔颌面组织生物力学和生物材料','H1410':'口腔颌面疾病诊疗新技术','H1411':'口腔颌面疾病其他科学问题','H15':'急重症医学','H1501':'心肺复苏','H1502':'多脏器衰竭','H1503':'中毒','H1504':'创伤','H1505':'烧伤','H1506':'冻伤','H1507':'创面愈合与瘢痕','H1508':'体表组织器官畸形','H1509':'体表组织器官移植与再造','H1510':'颅颌面畸形与矫正','H1511':'急重症医学','H16':'肿瘤学','H1601':'肿瘤病因','H1602':'肿瘤发生','H1603':'肿瘤遗传与表观遗传','H1604':'肿瘤免疫','H1605':'肿瘤预防','H1606':'肿瘤复发与转移','H1607':'肿瘤干细胞','H1608':'肿瘤诊断','H1609':'肿瘤化学药物治疗','H1610':'肿瘤物理治疗','H1611':'肿瘤生物治疗','H1612':'肿瘤综合治疗','H1613':'肿瘤康复','H1614':'肿瘤研究体系新技术','H1615':'呼吸系统肿瘤','H1617':'消化系统肿瘤','H1618':'神经系统肿瘤','H1619':'泌尿系统肿瘤','H1620':'男性生殖系统肿瘤','H1621':'女性生殖系统肿瘤','H1622':'乳腺肿瘤','H1623':'内分泌系统肿瘤','H1624':'骨与软组织肿瘤','H1625':'头颈部及颌面肿瘤','H1626':'皮肤','H17':'康复医学','H1701':'康复医学','H18':'影像医学与生物医学工程','H1801':'磁共振结构成像与疾病诊断','H1802':'','H1803':'磁共振成像技术与造影剂','H1804':'','H1805':'医学超声与声学造影剂','H1806':'核医学','H1807':'医学光子学','H1808':'分子影像与分子探针','H1809':'医学图像数据处理与分析','H1810':'脑电图','H1811':'人体医学信号检测','H1812':'生物医学传感','H1813':'生物医学系统建模及仿真','H1814':'医学信息系统与远程医疗','H1815':'治疗计划','H1816':'介入医学与工程','H1817':'康复工程与智能控制','H1818':'药物','H1819':'纳米医学','H1820':'医用生物材料与植入科学','H1821':'细胞移植','H1822':'组织工程与再生医学','H1823':'人工器官与特殊感受器仿生医学','H1824':'电磁与物理治疗','H1825':'用于检测','H1826':'影像医学与生物医学工程其他科学问题','H19':'医学病原生物与感染','H1901':'病原细菌','H1902':'病原放线菌','H1903':'病原真菌','H1904':'病毒','H1905':'其他病原微生物及感染与宿主免疫','H1906':'寄生虫','H1907':'传染病媒介生物','H1908':'病原生物变异与耐药','H1909':'医院获得性感染','H1910':'性传播疾病','H1911':'病原生物与感染研究与诊疗新技术','H1912':'病原生物与感染其他科学问题','H20':'检验医学','H2001':'临床生物化学检验','H2002':'临床微生物学检验','H2003':'临床细胞学和血液学检验','H2004':'临床免疫学检验','H2005':'临床分子生物学检验','H2006':'临床检验新技术','H2007':'检验医学其他科学问题','H21':'特种医学','H2101':'特种医学','H22':'放射医学','H2201':'放射医学','H23':'法医学','H2301':'法医毒理','H2302':'法医物证学','H2303':'法医精神病学及法医临床学','H2304':'法医学其他科学问题','H24':'地方病学','H2401':'地方病学','H2402':'职业病学','H25':'老年医学','H2501':'老年医学','H26':'预防医学','H2601':'环境卫生','H2602':'职业卫生','H2603':'人类营养','H2604':'食品卫生','H2605':'妇幼保健','H2606':'儿童少年卫生','H2607':'卫生毒理','H2608':'卫生分析化学','H2609':'传染病流行病学','H2610':'非传染病流行病学','H2611':'流行病学方法与卫生统计','H2612':'预防医学其他科学问题','H27':'中医学','H2701':'脏腑气血津液体质','H2702':'病因病机','H2703':'证候基础','H2704':'治则与治法','H2705':'中医方剂','H2706':'中医诊断','H2707':'经络与腧穴','H2708':'中医内科','H2709':'中医外科','H2710':'中医骨伤科','H2711':'中医妇科','H2712':'中医儿科','H2713':'中医眼科','H2714':'中医耳鼻喉科','H2715':'中医口腔科','H2716':'中医老年病','H2717':'中医养生与康复','H2718':'中医针灸','H2719':'按摩推拿','H2720':'民族医学','H2721':'中医学其他科学问题','H28':'中药学','H2801':'中药资源','H2802':'中药鉴定','H2803':'中药药效物质','H2804':'中药质量评价','H2805':'中药炮制','H2806':'中药制剂','H2807':'中药药性理论','H2808':'中药神经精神药理','H2809':'中药心脑血管药理','H2810':'中药抗肿瘤药理','H2811':'中药内分泌及代谢药理','H2812':'中药抗炎与免疫药理','H2813':'中药抗病毒与感染药理','H2814':'中药消化与呼吸药理','H2815':'中药泌尿与生殖药理','H2816':'中药药代动力学','H2817':'中药毒理','H2818':'民族药学','H2819':'中药学其他科学问题','H29':'中西医结合','H2901':'中西医结合基础理论','H2902':'中西医结合临床基础','H2903':'中医药学研究新技术和新方法','H30':'药物学','H3001':'合成药物化学','H3002':'天然药物化学','H3003':'微生物药物','H3004':'生物技术药物','H3005':'海洋药物','H3006':'特种药物','H3007':'药物设计与药物信息','H3008':'药剂学','H3009':'药物材料','H3010':'药物分析','H3011':'药物资源','H3012':'药物学其他科学问题','H31':'药理学','H3101':'神经精神药物药理','H3102':'心脑血管药物药理','H3103':'老年病药物药理','H3104':'抗炎与免疫药物药理','H3105':'抗肿瘤药物药理','H3106':'抗感染药物药理','H3107':'代谢性疾病药物药理','H3108':'消化与呼吸系统药物药理','H3109':'血液','H3110':'药物代谢与药物动力学','H3111':'临床药理','H3112':'药物毒理','H3113':'药理学其他科学问题',
    'J01':'国家基础人才培养基金','J0101':'数学','J0102':'力学','J0103':'物理学','J0104':'化学','J0105':'地学','J0106':'生物学','J0107':'心理学','J0108':'基础','J0109':'特殊学科点','J02':'青少年及软课题','J0201':'青少年科技活动','J0202':'计划局软课题','J03':'重点实验室','J04':'计划局委主任基金',
    'L00':'联合基金战略研究','L0011':'机械与运载工程技术领域','L0012':'信息与电子工程技术领域','L0013':'化工','L0014':'能源与矿业工程技术领域','L0015':'土木','L0016':'环境与轻纺工程技术领域','L0017':'农业技术领域','L0018':'医药卫生技术领域','L01':'农业领域','L02':'人口与健康领域','L03':'资源与环境领域','L04':'新材料与先进制造领域','L05':'电子信息领域','L06':'生物多样性保护领域','L07':'矿产资源综合利用与新材料领域','L08':'水资源与矿产资源领域','L09':'矿产资源领域','L10':'农业','L11':'新能源新材料领域','L12':'水产生物资源研究领域','L13':'食品安全检测技术领域','L14':'管理科学领域','L15':'生物与农业领域',
    'M01':'委办公室委主任基金',
    'R10':'国际合作局','R20':'国际合作局','R30':'国际合作局','R40':'国际合作局','R50':'国际合作局'
}
allcode = {'A01':'数学', 'A02':'力学', 'A03':'天文学', 'A04':'物理学Ⅰ', 'A05':'物理学Ⅱ', 'A06':'NSFC-中物院联合基金', 'A08':'大科学装置联合基金', 'A09':'天文联合基金',
          'B01':'合成化学','B02':'催化剂与表界面化学','B03':'化学理论与机制','B04':'化学测量学','B05':'材料化学与能源化学','B06':'环境化学','B07':'化学生物学','B08':'化学工程与工业化学',
          'C01':'微生物学','C02':'植物学','C03':'生态学','C04':'动物学','C05':'生物物理与生物化学','C06':'遗传学与生物信息学','C07':'细胞生物学','C08':'免疫学','C09':'神经科学与心理学',
          'C10':'生物材料、成像与组织工程学','C11':'生理学与整合生物学','C12':'发育生物学与生殖生物学','C13':'农学基础与作物学','C14':'植物保护学','C15':'园艺学与植物营养学','C16':'林学与草地科学',
          'C17':'畜牧学','C18':'兽医学','C19':'水产学','C20':'食品科学','C21':'分子生物学与生物技术',
          'D01':'地理学','D02':'地质学','D03':'地球化学','D04':'地球物理学和空间物理学','D05':'大气科学','D06':'海洋科学','D07':'环境地球科学',
          'E01':'金属材料','E02':'无机非金属材料','E03':'有机敲分子材料','E04':'矿业与治金工程','E05':'机械设计与制造','E06':'工程热物理与能源利用','E07':'电气科学与工程','E08':'建筑与土木工程',
          'E09':'水利工程','E10':'环境工程','E11':'海洋工程','E12':'交通与运载工程','E13':'新概念材料与材料共性科学',
          'F01':'电子学与信息系统','F02':'计算机科学','F03':'自动化','F04':'半导体科学与信息器件','F05':'光学和光电子学','F06':'人工智能','F07':'交叉学科中的信息科学',
          'G01':'管理科学与工程','G02':'工商管理','G03':'经济科学','G04':'宏观管理与政策',
          'H01':'呼吸系统','H02':'循环系统','H03':'消化系统','H04':'生殖系统/围生医学/新生儿','H05':'泌尿系统','H06':'运动系统','H07':'内分泌系统/代谢和营养支持','H08':'血液系统','H09':'神经系统和精神疾病',
          'H10':'医学免疫学', 'H11':'皮肤及其附属器', 'H12':'眼科学', 'H13':'鼻咽喉头颈科学', 'H14':'口腔颅领面科学', 'H15':'急症医学/创伤/烧伤/整形', 'H16':'肿瘤学', 'H17':'康复医学', 'H18':'影像医学与生物医学工程',
          'H19':'医学病原生物与感染', 'H20':'检验医学', 'H21':'特种医学', 'H22':'放射医学', 'H23':'法医学', 'H24':'地方病学/职业病学', 'H25':'老年医学', 'H26':'预防医学', 'H27':'中医学', 'H28':'中药学', 'H29':'中西医结合', 'H30':'药物学', 'H31':'药理学',
          'J01':'国家基础入才培养基金', 'J02':'青少年及软课题', 'J03':'重点实验室', 'J04':'计划委主任基金',
          'L00':'联合基金战略研究', 'L01':'农业领域', 'L02':'人口与健康领域', 'L03':'资源与环境领域', 'L04':'新材料与先进制造领域', 'L05':'电子信息领域', 'L06':'生物多样性保护领域', 'L07':'矿产资源综合利用与新材料领域', 'L08':'水资源与矿产资源领域',
          'L09':'矿产资源领域', 'L10':'农业', 'L11':'新能源新材料领域', 'L12':'水产生物资源研究领域', 'L13':'食品安全检测技术领域', 'L14':'管理科学领域', 'L15':'生物与农业领域',
          'M01':'委办公室委主任基金', 'R10':'国际合作局', 'R20':'国际合作局', 'R30':'国际合作局', 'R40':'国际合作局', 'R50':'国际合作局',
          'Z01':' '}


sel = driver.find_elements_by_xpath("//select[@id='f_grantCode']/option")   #0为空，1，2，7,8必须同时选择申请代码
sel2 = driver.find_elements_by_xpath("//select[@id='f_year']/option")
l = list(allcodes.values())
ks = list(allcodes.keys())
# 数据采集
f = open('data7.xls', 'a', encoding='utf-8_sig')
# f.write('项目名称,批准金额,年度,起始日期,类型,申请代码,申请方向,项目批准号,项目负责人,依托单位\n')
# for i in range(1, len(sel)):
#     if i == 1 or i == 2 or i == 7 or i == 8:
#         continue
#     else:
#         # 资助类别选择
#         seltext = sel[i].text
#         print(seltext)
#         sel[i].click()
#
#         # 年限选择
#         sel = driver.find_element_by_id("f_year")
#         sel.find_element_by_css_selector("option[value='2018']").click()
#         # 验证码操作
#         code_tesseract("img_checkcode", "f_checkcode")
#
#         # 搜索确定
#         driver.find_element_by_id('searchBt').click()
#         ele_locator = "scmtip_content"
#         param = (By.ID, ele_locator)
#         try:
#             while WebDriverWait(driver, 3).until(EC.visibility_of_element_located(param)):
#                 driver.find_element_by_id('img_checkcode').click()
#                 code_tesseract("img_checkcode", "f_checkcode")
#                 driver.find_element_by_id('searchBt').click()
#         except TimeoutException as e:
#             pass
#
#         # 数据采集
#
#         # 页数获取
#         try:
#             op = driver.find_element_by_id('sp_1_dataBar').text
#         except  Exception as e:
#             print(e)
#             continue
#         if op == '':
#             op = '0'
#         elif ',' in op:
#             op = op.replace(',', '')
#         # print('op:'+op)
#         page_sum = int(op)
#         # print('page_sum:',page_sum)
#         try:
#             ol = driver.find_element_by_id('sp_2_dataBar').text
#         except Exception as e:
#             print()
#             continue
#         if ol == '':
#
#             ol = '0'
#         elif ',' in ol:
#             ol = ol.replace(',', '')
#         # print('ol:'+ol)
#         list_sum = int(ol)
#         # print('list_sum:',list_sum)
#         if page_sum == 0 & list_sum == 0:
#             try:
#                 driver.back()
#             except Exception as e:
#                 print()
#                 continue
#
#             # driver.refresh()
#             sel = driver.find_elements_by_xpath("//select[@id='f_grantCode']/option")  # 0为空，1，2，10，11必须同时选择申请代码
#             sel2 = driver.find_elements_by_xpath("//select[@id='f_year']/option")
#             continue
#         # # 数据采集
#         # f = open('newdatas.xls', 'a+', encoding='utf-8_sig')
#         # f.write('项目名称,批准金额,年度,起始日期,类型,申请代码,申请方向,项目批准号\n')
#         for prow in range(page_sum):
#             table = driver.find_element_by_id('dataGrid')
#             table_rows = table.find_elements_by_tag_name('tr')
#             print('第', prow + 1, '页')
#             # sel[i].text
#             for row in range(1, len(table_rows)):
#                 prjNo = table_rows[row].find_elements_by_tag_name('td')[1].text
#                 subjectCode = table_rows[row].find_elements_by_tag_name('td')[2].text
#                 nt = subjectCode[0:3]
#                 ctitle = table_rows[row].find_elements_by_tag_name('td')[3].text.replace(",",".")
#                 psnName = table_rows[row].find_elements_by_tag_name('td')[4].text
#                 orgName = table_rows[row].find_elements_by_tag_name('td')[5].text
#                 totalAmt = table_rows[row].find_elements_by_tag_name('td')[6].text
#                 startEndDate = table_rows[row].find_elements_by_tag_name('td')[7].text
#                 f.write(f'{ctitle},{totalAmt},{"2018"},{startEndDate},{seltext},{subjectCode},{allcode[nt]},{prjNo},{psnName},{orgName}\n')
#                 # f.write(f'{prjNo},{subjectCode},{ctitle},{psnName},{orgName},{totalAmt},{startEndDate}\n')
#                 # print('row:',row)
#             if prow != page_sum - 1:
#                 # 验证码操作
#                 code_tesseract("img_checkcode", "checkCode")
#                 # 点击下一页
#                 try:
#                     driver.find_element_by_id('next_dataBar').click()
#                 except  Exception as e:
#                     print(e)
#                     continue
#                 try:
#                     while WebDriverWait(driver, 3).until(EC.visibility_of_element_located(param)):
#                         # ielement = driver.find_element_by_id('img_checkcode')
#                         # driver.execute_script("arguments[0].click();", ielement)
#                         driver.find_element_by_id('img_checkcode').click()
#                         code_tesseract("img_checkcode", "checkCode")
#                         driver.find_element_by_id('next_dataBar').click()
#                 except TimeoutException as e:
#                     pass
#             sleep(random.randint(1, 3))
#
#         else:
#             try:
#                 driver.back()
#             except Exception as e:
#                 print(e)
#                 # continue
#             sel = driver.find_elements_by_xpath("//select[@id='f_grantCode']/option")  # 0为空，1，2，10，11必须同时选择申请代码
#             sel2 = driver.find_elements_by_xpath("//select[@id='f_year']/option")
#             sleep(random.randint(1, 3))
#             # print(i)
#             # continue

# p2 = [1,2,7,8]
p2 = [2]
for i in p2:
    for k in range(len(ks)):
        try:
            driver.find_elements_by_xpath("//select[@id='f_year']/option")[2].click()
            seltext = sel[i].text
            print('正在爬取的资助类别为：',seltext)
            sel[i].click()
            sleep(random.randint(1, 3))
            print('正在爬取的申请代码为：',allcodes[ks[k]])

            driver.find_element_by_id('f_subjectCode').clear()
            sleep(random.randint(1, 3))
            driver.find_element_by_id('f_subjectCode').send_keys(ks[k])
            sleep(random.randint(1, 3))
            nele_locator = "//div[@class='ac_results']"
            nparam = (By.XPATH, nele_locator)
            try:
                while WebDriverWait(driver, 3).until(EC.visibility_of_element_located(nparam)):
                    elements = driver.find_elements_by_xpath('//div[@class="ac_results"]/ul/li')
                    driver.execute_script("arguments[0].click();", elements[0])
                    sleep(1)
            except TimeoutException as e:
                pass

        except Exception as e:
            print(e)
            continue

        # 验证码操作
        code_tesseract("img_checkcode", "f_checkcode")

        # 搜索确定
        driver.find_element_by_id('searchBt').click()
        # try:
        #     driver.find_element_by_id('searchBt').click()
        # except Exception as e:
        #     print(e)
        #     continue
        ele_locator = "scmtip_content"
        param = (By.ID, ele_locator)
        loc = ("id", "scmtip_content")
        text2 = '申请代码不能为空'
        try:
            while WebDriverWait(driver, 3).until(EC.visibility_of_element_located(param)) or WebDriverWait(driver, 3).until(EC.text_to_be_present_in_element(loc, text2)):
                if WebDriverWait(driver, 3).until(EC.visibility_of_element_located(param)):
                    ielement = driver.find_element_by_id('img_checkcode')
                    driver.execute_script("arguments[0].click();", ielement)
                    # driver.find_element_by_id('img_checkcode').click()
                    code_tesseract("img_checkcode", "f_checkcode")
                    # sleep(1)
                    driver.find_element_by_id('searchBt').click()
                else:
                    qqq = driver.find_element_by_id('f_subjectCode')
            # 对定位到的元素执行鼠标双击操作
                    ActionChains(driver).double_click(qqq).perform()
                    driver.find_element_by_id('f_subjectCode').click()
                    ActionChains(driver).send_keys(Keys.ENTER).perform()
                    driver.find_element_by_id('searchBt').click()


        except TimeoutException as e:
            pass

        # 数据采集

        # 页数获取
        try:
            op = driver.find_element_by_id('sp_1_dataBar').text
        except  Exception as e:
            print(e)
            continue
        if op == '':
            op = '0'
        elif ',' in op:
            op = op.replace(',', '')
        # print('op:'+op)
        page_sum = int(op)
        # print('page_sum:',page_sum)
        try:
            ol = driver.find_element_by_id('sp_2_dataBar').text
        except Exception as e:
            print()
            continue
        if ol == '':

            ol = '0'
        elif ',' in ol:
            ol = ol.replace(',', '')
        # print('ol:'+ol)
        list_sum = int(ol)
        # print('list_sum:',list_sum)
        if page_sum == 0 & list_sum == 0:
            try:
                driver.back()
            except Exception as e:
                print(e)
                continue

            # driver.refresh()
            sel = driver.find_elements_by_xpath("//select[@id='f_grantCode']/option")  # 0为空，1，2，10，11必须同时选择申请代码
            sel2 = driver.find_elements_by_xpath("//select[@id='f_year']/option")
            continue
        # # 数据采集
        # f = open('newdatas.xls', 'a+', encoding='utf-8_sig')
        # f.write('项目名称,批准金额,年度,起始日期,类型,申请代码,申请方向,项目批准号\n')
        for prow in range(page_sum):
            table = driver.find_element_by_id('dataGrid')
            table_rows = table.find_elements_by_tag_name('tr')
            print('正在爬取第', prow+1,'页')
            # sel[i].text
            for row in range(1, len(table_rows)):
                prjNo = table_rows[row].find_elements_by_tag_name('td')[1].text
                subjectCode = table_rows[row].find_elements_by_tag_name('td')[2].text
                ctitle = table_rows[row].find_elements_by_tag_name('td')[3].text.replace(",",".")
                psnName = table_rows[row].find_elements_by_tag_name('td')[4].text
                orgName = table_rows[row].find_elements_by_tag_name('td')[5].text
                totalAmt = table_rows[row].find_elements_by_tag_name('td')[6].text
                startEndDate = table_rows[row].find_elements_by_tag_name('td')[7].text
                f.write(f'{ctitle},{totalAmt},{"2018"},{startEndDate},{seltext},{subjectCode},{allcodes[ks[k]]},{prjNo},{psnName},{orgName}\n')
                # f.write(f'{prjNo},{subjectCode},{ctitle},{psnName},{orgName},{totalAmt},{startEndDate}\n')
                # print('row:',row)
            if prow != page_sum - 1:
                # 验证码操作
                code_tesseract("img_checkcode", "checkCode")
                # 点击下一页
                try:
                    driver.find_element_by_id('next_dataBar').click()
                except  Exception as e:
                    print(e)
                    continue
                try:
                    while WebDriverWait(driver, 3).until(EC.visibility_of_element_located(param)):
                        # ielement = driver.find_element_by_id('img_checkcode')
                        # driver.execute_script("arguments[0].click();", ielement)
                        driver.find_element_by_id('img_checkcode').click()
                        code_tesseract("img_checkcode", "checkCode")
                        driver.find_element_by_id('next_dataBar').click()
                except TimeoutException as e:
                    pass
            sleep(random.randint(1, 5))

        else:
            try:
                driver.back()
            except Exception as e:
                print(e)
                continue
            # driver.refresh()
            sel = driver.find_elements_by_xpath("//select[@id='f_grantCode']/option")  # 0为空，1，2，10，11必须同时选择申请代码
            sel2 = driver.find_elements_by_xpath("//select[@id='f_year']/option")
            sleep(random.randint(1, 5))
            # print(i)
            # continue


    else:
        try:
            driver.back()
        except Exception as e:
            print(e)
            continue
        # driver.refresh()
        sel = driver.find_elements_by_xpath("//select[@id='f_grantCode']/option")  # 0为空，1，2，10，11必须同时选择申请代码
        sel2 = driver.find_elements_by_xpath("//select[@id='f_year']/option")
        sleep(random.randint(1, 5))
else:
    driver.quit()
    f.close()
    print("抓取完毕！！")
elocaltime = time.asctime( time.localtime(time.time()) )
print ("截取时间为 :", elocaltime)